note/linux就是这个范儿.org
#+title: linux就是这个范儿
#+author: CYQ
#+data:<2021-11-03 Wed>
#+LANGUAGE: zh-CN
#+html_head: <link rel="stylesheet" type="text/css" href="./css/worg-classic .css"/>
#+num: t
#+toc: 4
* 第一章 第一次亲密接触
** 不一样的图形操作
*** 没有图形的图形
Linux本身是没有图形界面的，Linux只是一个内核。 所有的类UNIX操作系统本身都没有图形用户界面。 
**** Linux通过一个软件提供图形界面
  - XFree86 （1992-2004）
  - xorg （2004年以后）
    2004年XFree86的开发商改变了软件按许可，引发GNU社区的极大不满，于是从XFree86 4.4 RC2衍生出了xorg。 目前几乎所开源的类Unix操作系统用的都是xorg。
**** X和xorg
X不是什么具体的软件，是一种协议，和http协议一样。 xorg是实现X协议的服务器软件，这个和实现http协议的Apache软件是一样的概念。 xorg通过X协议来提供图形用户界面服务。 Apache 的客户端请求Apache得到HTML内容， 而xorg可客户端请求xorg的结果是向屏幕上画图。 不同的是，Apache只能被动的接受客户端请求，而xorg还需要主动将当前键盘按键和鼠标位置等信息通知给客户端。
Linux上的那些拥有图形用户界面的软件实际上都是xorg的客户端，他们利用X协议让xorg在屏幕上画出窗口或通过xorg获得键盘和鼠标事件。
**** Window Manager (WM) —— 窗口管理器
是一类X协议客户端程序。 如：KDE、GNOME、XFCE …… 
**** Display Manager（DM） —— 显示管理器
负责图形界面的用户登录问题。 系统启动之后，第一个要启动的X客户端程序就应该是DM， DM也是一类软件，如：XDM、KDM、GDM …… 
*** 架构设计

** 主流桌面环境

| 桌面环境 | 特点             |
|----------+------------------|
| KDE      | 初学首先         |
| GNOME    | 经典             |
| XFCE     | 轻量、简单、高效 |
| LXDE     | 更轻量              | 

** 反璞归真的命令行
*** 执行命令
- 用户通过shell执行命令
- #和$提示符, 前者root后者普通用户
*** 文本和图形的切换
- ctrl+alt+f1～f6  ---------- 6个文本终端
- ctrl+alt+f7      ---------- 图形界面
*** 基础的命令操作

| 命令           | 说明                                                     |
|----------------+----------------------------------------------------------|
| 目录和文件处理 |                                                          |
| mkdir          | 建立目录                                                 |
| ls             | 列出目录下的内容                                         |
| cd             | 更换工作目录                                             |
| pwd            | 显示当前工作目录                                         |
| cp             | 拷贝文件和目录                                           |
| mv             | 移动（重命名）文件                                       |
| rm             | 删除目录或文件                                           |
| 文本处理       |                                                          |
| cat            | 显示到标准输出                                           |
| more           | 查看文件内容，满页时暂停                                 |
| less           | 和more类似，但是允许用方向键上下卷动                     |
| head           | 查看文件头部内容                                         |
| tail           | 查看文件尾部内容                                 |
| echo           | 显示一行文本，显示变量的内容               |
| 系统管理   |                                                          |
| ps             | 查看进程                                             |
| kill           | 删除执行中的程序或工作                                   |
| jobs           | 通过jobs命令查看后台正在执行的命令的序号（不是进程号id） |
| bg             | 指定号码（非进程号）的命令进程放到后台执行               |
| fg             | 指定号码（非进程号）的命令进程放到前台执行               |
| 文件系统       |                                                          |
| du             | 查看目录或文件所占用磁盘空间的大小                       |
| df             | 检查文件系统的磁盘空间占用                               |
*** 终端下的常用快捷键
| 常用快捷键 | 说明                 |
| tab        | 自动完成             |
| ctrl-a     | 光标移到命令的头部   |
| ctrl-e     | 光标移到命令的尾部   |
| ctrl-c     | 终止当前进程         |
| ctrl-s     | 终止终端传输         |
| ctrl-p     | 上一条执行的命令     |
| ctrl-n     | 下一条执行的命令     |
| ctrl-f     | 光标右移一个字符     |
| ctrl-b     | 光标左移一个字符     |
| alt-f      | 光标右移一个单词     |
| alt-b      | 光标左移一个单词     |
| ctrl-k     | 删除光标后的所有字符 |
| ctrl-d     | 删除光标前的所有字符 |
| alt-f1     | 开始菜单                 |
