note/linux就是这个范儿.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<!-- 2025-12-07 Sun 12:17 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux就是这个范儿</title>
<meta name="author" content="CYQ" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./css/worg-classic .css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">linux就是这个范儿</h1>
<div id="table-of-contents" role="doc-toc">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf6a46f2">1. 第一章 第一次亲密接触</a>
<ul>
<li><a href="#orgcc6a469">1.1. 不一样的图形操作</a>
<ul>
<li><a href="#orgcc717b6">1.1.1. 没有图形的图形</a></li>
<li><a href="#org41a3d40">1.1.2. 架构设计</a></li>
</ul>
</li>
<li><a href="#org1854959">1.2. 主流桌面环境</a></li>
<li><a href="#orgc62c9b0">1.3. 反璞归真的命令行</a>
<ul>
<li><a href="#org5592e04">1.3.1. 执行命令</a></li>
<li><a href="#orgbc26115">1.3.2. 文本和图形的切换</a></li>
<li><a href="#org44aebda">1.3.3. 基础的命令操作</a></li>
<li><a href="#org48222dc">1.3.4. 终端下的常用快捷键</a></li>
<li><a href="#org3195e17">1.3.5. 联机帮助-man</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1c83a1d">2. 第二章 融于心而表于行</a>
<ul>
<li><a href="#orgffeed76">2.1. 多用户多任务分时操作系统</a></li>
<li><a href="#org3154f99">2.2. 用户的身份</a>
<ul>
<li><a href="#orgfef0297">2.2.1. Linux下的用户只有两个等级</a></li>
<li><a href="#org13ce6c3">2.2.2. /etc/passwd 文件查看用户信息</a></li>
<li><a href="#orgd465424">2.2.3. /etc/group 文件查看组</a></li>
<li><a href="#orgba04812">2.2.4. 管理用户和组</a></li>
</ul>
</li>
<li><a href="#org8be4014">2.3. 文件和权限</a>
<ul>
<li><a href="#orgf353b11">2.3.1. 目录和文件</a></li>
<li><a href="#org09f672d">2.3.2. 文件属性和权限</a></li>
<li><a href="#orgaa0e1f1">2.3.3. 文件连接数</a></li>
<li><a href="#org5702b39">2.3.4. 修改文件的属性和权限</a></li>
</ul>
</li>
<li><a href="#orgb2ab0cf">2.4. 文件的基本操作</a>
<ul>
<li><a href="#orgb8aa2a1">2.4.1. 常用的文件管理命令：</a></li>
<li><a href="#org0a9d287">2.4.2. 搜索文件</a></li>
<li><a href="#orgf80492a">2.4.3. 文件打包压缩</a></li>
</ul>
</li>
<li><a href="#orga5517b3">2.5. 程序的执行问题</a>
<ul>
<li><a href="#orgc107c4d">2.5.1. 执行程序的方法和多任务协调机制</a></li>
<li><a href="#orgd12c7e6">2.5.2. 计划任务</a></li>
<li><a href="#org20cdd0c">2.5.3. 守护进程及其作用（daemons）</a></li>
<li><a href="#org9dfefc1">2.5.4. 全面了解程序信息</a></li>
</ul>
</li>
<li><a href="#org98b55ff">2.6. 软件的安装</a>
<ul>
<li><a href="#orgd29d6c6">2.6.1. 从源码安装</a></li>
<li><a href="#org0175d56">2.6.2. 利用软件管理工具rpm和dpkg</a></li>
<li><a href="#org4277936">2.6.3. 在线安装机制</a></li>
</ul>
</li>
<li><a href="#orgd051e16">2.7. 磁盘的管理方式</a>
<ul>
<li><a href="#orgd4fb8bd">2.7.1. linux的文件系统</a></li>
<li><a href="#org06a6d4f">2.7.2. 磁盘的基本操作</a></li>
<li><a href="#org8f66246">2.7.3. /etc/fstab文件 —— 决定分区的连接</a></li>
<li><a href="#org636928d">2.7.4. 逻辑卷</a></li>
</ul>
</li>
<li><a href="#orga5d1920">2.8. linux下的网络基础</a>
<ul>
<li><a href="#org0c7e463">2.8.1. 了解ip地址</a></li>
<li><a href="#org235d577">2.8.2. 相关配置文件</a></li>
</ul>
</li>
<li><a href="#org177c5d7">2.9. sh相关知识</a>
<ul>
<li><a href="#orgf9f1e94">2.9.1. bash</a></li>
<li><a href="#orgc252068">2.9.2. 环境变量</a></li>
<li><a href="#org2dae6e5">2.9.3. bash的配置文件</a></li>
</ul>
</li>
<li><a href="#orga78c8b2">2.10. 文本处理</a>
<ul>
<li><a href="#org422794b">2.10.1. 查看文本内容</a></li>
<li><a href="#orgea9d47c">2.10.2. 正则表达式</a></li>
<li><a href="#org93e2eec">2.10.3. grep搜索文本</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4096462">3. 第三章 一棵“树”的奥秘</a>
<ul>
<li><a href="#org54e71d2">3.1. linux的文件组织结构（p109 图3.1）</a></li>
<li><a href="#orge75c334">3.2. 基本组织原则（p110）</a></li>
<li><a href="#org9b70d13">3.3. 根文件系统</a>
<ul>
<li><a href="#orgbf57334">3.3.1. 原则与特性</a></li>
<li><a href="#org1a30de2">3.3.2. 必备内容</a></li>
</ul>
</li>
<li><a href="#orgbb17a9f">3.4. 子目录</a>
<ul>
<li><a href="#org14996b7">3.4.1. /etc目录</a></li>
<li><a href="#orgc091672">3.4.2. /sbin目录——必备的系统软件</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org42af428">4. 第四章 笨出来的文化和哲学</a>
<ul>
<li><a href="#org9431a1f">4.1. 万般皆文本</a>
<ul>
<li><a href="#orgd67d298">4.1.1. 配置文件的DSV风格</a></li>
</ul>
</li>
<li><a href="#orgd31caf5">4.2. linux中的配置文件</a>
<ul>
<li><a href="#org5963dea">4.2.1. 配置三元素</a></li>
<li><a href="#orgc4ba8c8">4.2.2. 配置文件</a></li>
<li><a href="#orgce63d9c">4.2.3. 环境变量</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4818152">5. 第五章 shell脚本编程</a>
<ul>
<li><a href="#orgfd05c4f">5.1. 第一个shell脚本程序</a>
<ul>
<li><a href="#orgbaa9100">5.1.1. 程序代码</a></li>
<li><a href="#org04dc9a1">5.1.2. 注解：</a></li>
<li><a href="#orgb3ea792">5.1.3. 变量</a></li>
<li><a href="#org1e77214">5.1.4. 运算</a></li>
</ul>
</li>
<li><a href="#org2c53f30">5.2. 脚本的基本要素</a>
<ul>
<li><a href="#org6144290">5.2.1. 变量</a></li>
<li><a href="#org09d134b">5.2.2. 运算</a></li>
<li><a href="#org4ea1a9d">5.2.3. 流程控制</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org313f498">6. 第七章 编辑器</a>
<ul>
<li><a href="#org3c956c9">6.1. vi</a></li>
<li><a href="#org5290fd7">6.2. emacs</a>
<ul>
<li><a href="#org2b540ef">6.2.1. emacs的来历</a></li>
<li><a href="#orge1bbcf0">6.2.2. buffer、window、frame</a></li>
<li><a href="#orgd468bb9">6.2.3. emscs的基本使用</a></li>
<li><a href="#org8459b66">6.2.4. Lisp语言</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfa5adb3">7. 第九章 特种文件系统</a>
<ul>
<li><a href="#org0cbf999">7.1. 日志和ReiserFS</a>
<ul>
<li><a href="#org0007538">7.1.1. 理解日志</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf6a46f2" class="outline-2">
<h2 id="orgf6a46f2"><span class="section-number-2">1.</span> 第一章 第一次亲密接触</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgcc6a469" class="outline-3">
<h3 id="orgcc6a469"><span class="section-number-3">1.1.</span> 不一样的图形操作</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orgcc717b6" class="outline-4">
<h4 id="orgcc717b6"><span class="section-number-4">1.1.1.</span> 没有图形的图形</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Linux本身是没有图形界面的，Linux只是一个内核。 所有的类UNIX操作系统本身都没有图形用户界面。 
</p>
</div>
<ol class="org-ol">
<li><a id="orgcde7565"></a>Linux通过一个软件提供图形界面<br />
<div class="outline-text-5" id="text-1-1-1-1">
<ul class="org-ul">
<li>XFree86 （1992-2004）</li>
<li>xorg （2004年以后）
2004年XFree86的开发商改变了软件按许可，引发GNU社区的极大不满，于是从XFree86 4.4 RC2衍生出了xorg。 目前几乎所开源的类Unix操作系统用的都是xorg。</li>
</ul>
</div>
</li>
<li><a id="org808ba4a"></a>X和xorg<br />
<div class="outline-text-5" id="text-1-1-1-2">
<p>
X不是什么具体的软件，是一种协议，和http协议一样。 xorg是实现X协议的服务器软件，这个和实现http协议的Apache软件是一样的概念。 xorg通过X协议来提供图形用户界面服务。 Apache 的客户端请求Apache得到HTML内容， 而xorg可客户端请求xorg的结果是向屏幕上画图。 不同的是，Apache只能被动的接受客户端请求，而xorg还需要主动将当前键盘按键和鼠标位置等信息通知给客户端。
Linux上的那些拥有图形用户界面的软件实际上都是xorg的客户端，他们利用X协议让xorg在屏幕上画出窗口或通过xorg获得键盘和鼠标事件。
</p>
</div>
</li>
<li><a id="orgbf4c654"></a>Window Manager (WM) —— 窗口管理器<br />
<div class="outline-text-5" id="text-1-1-1-3">
<p>
是一类X协议客户端程序。 如：KDE、GNOME、XFCE …… 
</p>
</div>
</li>
<li><a id="orgb7c8522"></a>Display Manager（DM） —— 显示管理器<br />
<div class="outline-text-5" id="text-1-1-1-4">
<p>
负责图形界面的用户登录问题。 系统启动之后，第一个要启动的X客户端程序就应该是DM， DM也是一类软件，如：XDM、KDM、GDM …… 
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org41a3d40" class="outline-4">
<h4 id="org41a3d40"><span class="section-number-4">1.1.2.</span> 架构设计</h4>
</div>
</div>
<div id="outline-container-org1854959" class="outline-3">
<h3 id="org1854959"><span class="section-number-3">1.2.</span> 主流桌面环境</h3>
<div class="outline-text-3" id="text-1-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">桌面环境</th>
<th scope="col" class="org-left">特点</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">KDE</td>
<td class="org-left">初学首先</td>
</tr>

<tr>
<td class="org-left">GNOME</td>
<td class="org-left">经典</td>
</tr>

<tr>
<td class="org-left">XFCE</td>
<td class="org-left">轻量、简单、高效</td>
</tr>

<tr>
<td class="org-left">LXDE</td>
<td class="org-left">更轻量</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc62c9b0" class="outline-3">
<h3 id="orgc62c9b0"><span class="section-number-3">1.3.</span> 反璞归真的命令行</h3>
<div class="outline-text-3" id="text-1-3">
</div>
<div id="outline-container-org5592e04" class="outline-4">
<h4 id="org5592e04"><span class="section-number-4">1.3.1.</span> 执行命令</h4>
<div class="outline-text-4" id="text-1-3-1">
<ul class="org-ul">
<li>用户通过shell执行命令</li>
<li>#和$提示符, 前者root后者普通用户</li>
</ul>
</div>
</div>
<div id="outline-container-orgbc26115" class="outline-4">
<h4 id="orgbc26115"><span class="section-number-4">1.3.2.</span> 文本和图形的切换</h4>
<div class="outline-text-4" id="text-1-3-2">
<ul class="org-ul">
<li>ctrl+alt+f1～f6  -----&#x2013;&#x2014; 6个文本终端</li>
<li>ctrl+alt+f7      -----&#x2013;&#x2014; 图形界面</li>
</ul>
</div>
</div>
<div id="outline-container-org44aebda" class="outline-4">
<h4 id="org44aebda"><span class="section-number-4">1.3.3.</span> 基础的命令操作</h4>
<div class="outline-text-4" id="text-1-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">目录和文件处理</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">mkdir</td>
<td class="org-left">建立目录</td>
</tr>

<tr>
<td class="org-left">ls</td>
<td class="org-left">列出目录下的内容</td>
</tr>

<tr>
<td class="org-left">cd</td>
<td class="org-left">更换工作目录</td>
</tr>

<tr>
<td class="org-left">pwd</td>
<td class="org-left">显示当前工作目录</td>
</tr>

<tr>
<td class="org-left">cp</td>
<td class="org-left">拷贝文件和目录</td>
</tr>

<tr>
<td class="org-left">mv</td>
<td class="org-left">移动（重命名）文件</td>
</tr>

<tr>
<td class="org-left">rm</td>
<td class="org-left">删除目录或文件</td>
</tr>

<tr>
<td class="org-left">文本处理</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">cat</td>
<td class="org-left">显示到标准输出</td>
</tr>

<tr>
<td class="org-left">more</td>
<td class="org-left">查看文件内容，满页时暂停</td>
</tr>

<tr>
<td class="org-left">less</td>
<td class="org-left">和more类似，但是允许用方向键上下卷动</td>
</tr>

<tr>
<td class="org-left">head</td>
<td class="org-left">查看文件头部内容</td>
</tr>

<tr>
<td class="org-left">tail</td>
<td class="org-left">查看文件尾部内容</td>
</tr>

<tr>
<td class="org-left">echo</td>
<td class="org-left">显示一行文本，显示变量的内容</td>
</tr>

<tr>
<td class="org-left">系统管理</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">ps</td>
<td class="org-left">查看进程</td>
</tr>

<tr>
<td class="org-left">kill</td>
<td class="org-left">删除执行中的程序或工作</td>
</tr>

<tr>
<td class="org-left">jobs</td>
<td class="org-left">通过jobs命令查看后台正在执行的命令的序号（不是进程号id）</td>
</tr>

<tr>
<td class="org-left">bg</td>
<td class="org-left">指定号码（非进程号）的命令进程放到后台执行</td>
</tr>

<tr>
<td class="org-left">fg</td>
<td class="org-left">指定号码（非进程号）的命令进程放到前台执行</td>
</tr>

<tr>
<td class="org-left">文件系统</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">du</td>
<td class="org-left">查看目录或文件所占用磁盘空间的大小</td>
</tr>

<tr>
<td class="org-left">df</td>
<td class="org-left">检查文件系统的磁盘空间占用</td>
</tr>
</tbody>
</table>
</div>
</div>
