note/linux就是这个范儿.org
*** 联机帮助-man
Linux系统获取帮助的途径
- man
  浏览man的默认工具是less，翻页用Space，查找用/，用n查找下一个匹配项，用Shift——n查找前一个匹配项。
- info
- 命令名 -help
- 自带的readme文件或/usr/share/doc下的手册
* 第二章 融于心而表于行
** 多用户多任务分时操作系统
** 用户的身份
*** Linux下的用户只有两个等级
- root
- 非root
*** /etc/passwd 文件查看用户信息
- 文件名看和密码有关，但是不是的，现在保存密码的文件是/etc/shadow，也就是传说中的影子文件
- 一行代表一个用户，每一行由冒号：分割成7个字段，结构如下：

#+BEGIN_QUOTE
用户名：密码：UID：GID：用户全名：home目录：shell
#+END_QUOTE

*** /etc/group 文件查看组
结构如下:

#+BEGIN_QUOTE
组名：用户组密码：GID：用户组内的用户名
#+END_QUOTE

*** 管理用户和组
**** adduser或useradd两者的差异
- 在ubuntu中adduser是一个脚本，而useradd是一个二进制程序，前者对后者进行了封装，更加智能。但在centos中，两者完全一样，前者只是一个符号链接.
- useradd在任何发行版中都是一样的
**** useradd
一个经常使用的参数 -d （创建home目录）。eg:

#+BEGIN_QUOTE
useradd -d cyq  (创建用户cyq并创建用户cyq的home目录）
#+END_QUOTE

**** 设置密码
passwd命令。eg.

#+BEGIN_QUOTE
passwd cyq  (设置用户cyq的登陆密码)
#+END_QUOTE

**** 删除用户
userdel命令，带上-r参数，会联通该用户的home目录一起删除
**** 管理用户组
用户组的管理和用户管理基本一样，将user换成group就可以。
**** sudo和sudoers文件
使普通用户具有root的权限;给某个用户sudo权限，其实就是更改/etc/sudoers文件中的内容。sudoers文件中的，%开头指用户组。
 eg.
  - 禁止user用户组的用户添加用户：
       *%user ALL=(ALL) ALL,   !/usr/sbin/adduser,  !/usr/sbin/useradd*    
     ！表示禁止执行某些命令

  - root用户的权限
      *root   All=(ALL)     ALL*
     root用户可以使用sudo获得root权限
**** su
- sudo必须在每个命令前面都加上sudo，su命令可以直接切换为root用户，使用exit可以切换回原用户。
- 直接执行su不会改变当前的home目录，如果执行su - 就会切换到root的home目录。
- su还可以切换为任意用户，用法，su user（su user -，会连home目录一起切换）。
- sudo su -   使用这个命令可以让任何普通用户用自己的密码切换到root用户,  这是及其不安全的,  必须要在sudoers中禁止sudo的 su -权限

***** sudo su user - 的弊端
这个命令直接使用用户自己的密码切换成任意用户，这是及其不安全的，应该在/etc/sudoers文件中明确禁止su被sudo执行
**** whoami和who am i和who
***** UID和EUID
UID——实际用户，用户登陆时所使用的用户。实际用户是不会发生改变的。
EUID——有效用户，当前执行操作的用户。能够利用su和sudo进行任意的切换。
***** 他们的区别
whoami查看的是EUID，后两者查看的是UID。
** 文件和权限
*** 目录和文件
- 蓝色代表目录
- 绿色代表可执行文件
- 青色代表符号链接
具体配置取决于配置文件/etc/DIR_COLORS的规定
**** 开启颜色区分
- ls --color=auto
- 创建命令别名：alias ls='ls --color=auto‘
- 使设置永远生效：将alias命令添加到/etc/bashrc或/home/<user>/.bashrc文件中
*** 文件属性和权限
**** 文件属性行的分析
***** 三种权限
- r —— 可读，数值为4;
- w —— 可写，数值为2;
- x —— 可执行，数值为1;
***** 属性结构 
共分为7段：
*文件类型和权限 连接数 拥有者 所属用户组 文件大小 最后修改日期 文件名*
***** 文件权限组分析
共9个字母，分为三段，每3个为一段，分别为拥有者权限，所属用户组权限，其他用户权限。
**** 文件类型分析
- “-” 代表普通文件
- “d” 代表目录shad
- 

   0-- “l” 代表软连接和硬连接
- “b” 代表块设备文件
- “c” 代表字符设备文件
- “s” 代表套接字文件
- “p" 代表命名管道文件
*** 文件连接数
**** linux保存文件的方法
linux使用的文件系统是一种基于inode的文件系统（索引节点），是所有类unix的文件系统核心，每一个新创建的的文件都会被分配一个inode，并且每个文件都有一个唯一的inode编号，可以将inode理解为一个指针，指向的是文件所在的磁盘中的物理位置。所有的文件属性也都保存在inode中，系统是通过inode来定位每一个文件的，而不是通过文件名。为提高文件系统的执行效率，访问过的文件的inode会被缓存在内存中。 

连接数这个属性就是inode的引用计数，增加这个引用计数的元应在于：linux允许一个文件拥有多个名字。 文件名只是相当于对inode的一次引用。在使用ln命令建立文件链接的时候，会增加文件的连接数（即引用计数）
**** ln命令创建文件连接
***** 默认创建硬连接
*注意*
1. 硬连接的文件属性和目标文件完全相同，使用同一个inode，仅仅将inode的引用计数+1.
2. 硬连接要求必须与目标文件在同一分区中
***** ln -s xxx xxx  创建软连接（相当于快捷方式）
*注意*
软连接的文件属性和目标文件完全不同，软连接要占据一个新的inode，即软连接是一个新的文件
*** 修改文件的属性和权限
**** 修改文件所属用户组：
chown [-R] username filename
**** 修改文件的权限：
chmod命令
***** 文字法修改权限：
****** 四个字母：
- u：拥有者
- g：所属组
- o：其他用户
- a：所有用户
****** 三个操作符号：
- + 代表怎家权限
- - 代表去掉权限
- = 表设定权限
**** 深入文件权限
Linux的文件权限不止是r、w、x，还包括s和t两个特殊权限，它们与系统的帐号和系统的进程相关。
***** s标记（SUID）
- s这个标记出现在文件拥有者的x权限位上，称为Set UID，简称SUID，SUID权限的功能
  - SUID仅对二进制程序有效;
  - 执行者对于该程序具有x的可执行权限;
  - 执行者仅在执行该程序的过程中有效;
  - 执行者将具有该程序拥有者的权限（su具有SUID权限，该命令的拥有者是root，非root的执行者执行su时获得su的拥有者root用户的权限，即非root用户执行su后，获得了root用户的权限。 换句话说，具有SUID权限的命令，用户不需要使用sudo，直接执行，就能获得root权限的效果。
- s这个标记出现在文件所数组的x权限位上，成为Set GID，简称SGID
***** 设置SUID
使用u+s来设置SUID权限
***** t标记
出现在其他用户的x权限位上，t权限的名称是Sticky Bit，简称SBIT，仅对目录有效，作用如下:
- 用户对此目录拥有w和x权限
- 当用户在此目录下创建了文件或目录，仅自己和root才有权利删除该文件。 实例如下：用户U在目录D下创建了文件F，若D拥有SBIT权限，那么仅有用户U和root能删除文件F。SBIT应用的典型例子是/tmp目录，这个目录允许任何用户在里面创建文件，但是为了避免创建的文件被其他用户删除，把tmp目录设置为SBIT 权限，使得自己创建的文件仅能让自己或root删除。

** 文件的基本操作
*** 常用的文件管理命令：
- ls
- cd
- cp
- rm
- mv
*** 搜索文件
