note/linux就是这个范儿.html
<div id="outline-container-org48222dc" class="outline-4">
<h4 id="org48222dc"><span class="section-number-4">1.3.4.</span> 终端下的常用快捷键</h4>
<div class="outline-text-4" id="text-1-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">常用快捷键</td>
<td class="org-left">说明</td>
</tr>

<tr>
<td class="org-left">tab</td>
<td class="org-left">自动完成</td>
</tr>

<tr>
<td class="org-left">ctrl-a</td>
<td class="org-left">光标移到命令的头部</td>
</tr>

<tr>
<td class="org-left">ctrl-e</td>
<td class="org-left">光标移到命令的尾部</td>
</tr>

<tr>
<td class="org-left">ctrl-c</td>
<td class="org-left">终止当前进程</td>
</tr>

<tr>
<td class="org-left">ctrl-s</td>
<td class="org-left">终止终端传输</td>
</tr>

<tr>
<td class="org-left">ctrl-p</td>
<td class="org-left">上一条执行的命令</td>
</tr>

<tr>
<td class="org-left">ctrl-n</td>
<td class="org-left">下一条执行的命令</td>
</tr>

<tr>
<td class="org-left">ctrl-f</td>
<td class="org-left">光标右移一个字符</td>
</tr>

<tr>
<td class="org-left">ctrl-b</td>
<td class="org-left">光标左移一个字符</td>
</tr>

<tr>
<td class="org-left">alt-f</td>
<td class="org-left">光标右移一个单词</td>
</tr>

<tr>
<td class="org-left">alt-b</td>
<td class="org-left">光标左移一个单词</td>
</tr>

<tr>
<td class="org-left">ctrl-k</td>
<td class="org-left">删除光标后的所有字符</td>
</tr>

<tr>
<td class="org-left">ctrl-d</td>
<td class="org-left">删除光标前的所有字符</td>
</tr>

<tr>
<td class="org-left">alt-f1</td>
<td class="org-left">开始菜单</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org3195e17" class="outline-4">
<h4 id="org3195e17"><span class="section-number-4">1.3.5.</span> 联机帮助-man</h4>
<div class="outline-text-4" id="text-1-3-5">
<p>
Linux系统获取帮助的途径
</p>
<ul class="org-ul">
<li>man
浏览man的默认工具是less，翻页用Space，查找用/，用n查找下一个匹配项，用Shift——n查找前一个匹配项。</li>
<li>info</li>
<li>命令名 -help</li>
<li>自带的readme文件或/usr/share/doc下的手册</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org1c83a1d" class="outline-2">
<h2 id="org1c83a1d"><span class="section-number-2">2.</span> 第二章 融于心而表于行</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgffeed76" class="outline-3">
<h3 id="orgffeed76"><span class="section-number-3">2.1.</span> 多用户多任务分时操作系统</h3>
</div>
<div id="outline-container-org3154f99" class="outline-3">
<h3 id="org3154f99"><span class="section-number-3">2.2.</span> 用户的身份</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-orgfef0297" class="outline-4">
<h4 id="orgfef0297"><span class="section-number-4">2.2.1.</span> Linux下的用户只有两个等级</h4>
<div class="outline-text-4" id="text-2-2-1">
<ul class="org-ul">
<li>root</li>
<li>非root</li>
</ul>
</div>
</div>
<div id="outline-container-org13ce6c3" class="outline-4">
<h4 id="org13ce6c3"><span class="section-number-4">2.2.2.</span> /etc/passwd 文件查看用户信息</h4>
<div class="outline-text-4" id="text-2-2-2">
<ul class="org-ul">
<li>文件名看和密码有关，但是不是的，现在保存密码的文件是/etc/shadow，也就是传说中的影子文件</li>
<li>一行代表一个用户，每一行由冒号：分割成7个字段，结构如下：</li>
</ul>

<blockquote>
<p>
用户名：密码：UID：GID：用户全名：home目录：shell
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd465424" class="outline-4">
<h4 id="orgd465424"><span class="section-number-4">2.2.3.</span> /etc/group 文件查看组</h4>
<div class="outline-text-4" id="text-2-2-3">
<p>
结构如下:
</p>

<blockquote>
<p>
组名：用户组密码：GID：用户组内的用户名
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgba04812" class="outline-4">
<h4 id="orgba04812"><span class="section-number-4">2.2.4.</span> 管理用户和组</h4>
<div class="outline-text-4" id="text-2-2-4">
</div>
<ol class="org-ol">
<li><a id="org9dccc86"></a>adduser或useradd两者的差异<br />
<div class="outline-text-5" id="text-2-2-4-1">
<ul class="org-ul">
<li>在ubuntu中adduser是一个脚本，而useradd是一个二进制程序，前者对后者进行了封装，更加智能。但在centos中，两者完全一样，前者只是一个符号链接.</li>
<li>useradd在任何发行版中都是一样的</li>
</ul>
</div>
</li>
<li><a id="org29031eb"></a>useradd<br />
<div class="outline-text-5" id="text-2-2-4-2">
<p>
一个经常使用的参数 -d （创建home目录）。eg:
</p>

<blockquote>
<p>
useradd -d cyq  (创建用户cyq并创建用户cyq的home目录）
</p>
</blockquote>
</div>
</li>
<li><a id="org5d6f472"></a>设置密码<br />
<div class="outline-text-5" id="text-2-2-4-3">
<p>
passwd命令。eg.
</p>

<blockquote>
<p>
passwd cyq  (设置用户cyq的登陆密码)
</p>
</blockquote>
</div>
</li>
<li><a id="org1c06944"></a>删除用户<br />
<div class="outline-text-5" id="text-2-2-4-4">
<p>
userdel命令，带上-r参数，会联通该用户的home目录一起删除
</p>
</div>
</li>
<li><a id="org40ec506"></a>管理用户组<br />
<div class="outline-text-5" id="text-2-2-4-5">
<p>
用户组的管理和用户管理基本一样，将user换成group就可以。
</p>
</div>
</li>
<li><a id="org17def71"></a>sudo和sudoers文件<br />
<div class="outline-text-5" id="text-2-2-4-6">
<p>
使普通用户具有root的权限;给某个用户sudo权限，其实就是更改/etc/sudoers文件中的内容。sudoers文件中的，%开头指用户组。
 eg.
</p>
<ul class="org-ul">
<li>禁止user用户组的用户添加用户：
  <b>%user ALL=(ALL) ALL,   !/usr/sbin/adduser,  !/usr/sbin/useradd</b>    
！表示禁止执行某些命令</li>

<li>root用户的权限
 <b>root   All=(ALL)     ALL</b>
root用户可以使用sudo获得root权限</li>
</ul>
</div>
</li>
<li><a id="org15fbaf6"></a>su<br />
<div class="outline-text-5" id="text-2-2-4-7">
<ul class="org-ul">
<li>sudo必须在每个命令前面都加上sudo，su命令可以直接切换为root用户，使用exit可以切换回原用户。</li>
<li>直接执行su不会改变当前的home目录，如果执行su - 就会切换到root的home目录。</li>
<li>su还可以切换为任意用户，用法，su user（su user -，会连home目录一起切换）。</li>
<li>sudo su -   使用这个命令可以让任何普通用户用自己的密码切换到root用户,  这是及其不安全的,  必须要在sudoers中禁止sudo的 su -权限</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgaa9a2f2"></a>sudo su user - 的弊端<br />
<div class="outline-text-6" id="text-2-2-4-7-1">
<p>
这个命令直接使用用户自己的密码切换成任意用户，这是及其不安全的，应该在/etc/sudoers文件中明确禁止su被sudo执行
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgcea3594"></a>whoami和who am i和who<br />
<ol class="org-ol">
<li><a id="org3962661"></a>UID和EUID<br />
<div class="outline-text-6" id="text-2-2-4-8-1">
<p>
UID——实际用户，用户登陆时所使用的用户。实际用户是不会发生改变的。
EUID——有效用户，当前执行操作的用户。能够利用su和sudo进行任意的切换。
</p>
</div>
</li>
<li><a id="orgba0ccb0"></a>他们的区别<br />
<div class="outline-text-6" id="text-2-2-4-8-2">
<p>
whoami查看的是EUID，后两者查看的是UID。
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org8be4014" class="outline-3">
<h3 id="org8be4014"><span class="section-number-3">2.3.</span> 文件和权限</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-orgf353b11" class="outline-4">
<h4 id="orgf353b11"><span class="section-number-4">2.3.1.</span> 目录和文件</h4>
<div class="outline-text-4" id="text-2-3-1">
<ul class="org-ul">
<li>蓝色代表目录</li>
<li>绿色代表可执行文件</li>
<li>青色代表符号链接</li>
</ul>
<p>
具体配置取决于配置文件/etc/DIR<sub>COLORS的规定</sub>
</p>
</div>
<ol class="org-ol">
<li><a id="org32ed412"></a>开启颜色区分<br />
<div class="outline-text-5" id="text-2-3-1-1">
<ul class="org-ul">
<li>ls &#x2013;color=auto</li>
<li>创建命令别名：alias ls='ls &#x2013;color=auto‘</li>
<li>使设置永远生效：将alias命令添加到/etc/bashrc或/home/&lt;user&gt;/.bashrc文件中</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org09f672d" class="outline-4">
<h4 id="org09f672d"><span class="section-number-4">2.3.2.</span> 文件属性和权限</h4>
<div class="outline-text-4" id="text-2-3-2">
</div>
<ol class="org-ol">
<li><a id="org58ac1c1"></a>文件属性行的分析<br />
<ol class="org-ol">
<li><a id="orgc630654"></a>三种权限<br />
<div class="outline-text-6" id="text-2-3-2-1-1">
<ul class="org-ul">
<li>r —— 可读，数值为4;</li>
<li>w —— 可写，数值为2;</li>
<li>x —— 可执行，数值为1;</li>
</ul>
</div>
</li>
<li><a id="org5b4c12c"></a>属性结构<br />
<div class="outline-text-6" id="text-2-3-2-1-2">
<p>
共分为7段：
<b>文件类型和权限 连接数 拥有者 所属用户组 文件大小 最后修改日期 文件名</b>
</p>
</div>
</li>
<li><a id="org0cdd8ea"></a>文件权限组分析<br />
<div class="outline-text-6" id="text-2-3-2-1-3">
<p>
共9个字母，分为三段，每3个为一段，分别为拥有者权限，所属用户组权限，其他用户权限。
</p>
</div>
</li>
</ol>
</li>
<li><a id="org4955390"></a>文件类型分析<br />
<div class="outline-text-5" id="text-2-3-2-2">
<ul class="org-ul">
<li>“-” 代表普通文件</li>
<li>“d” 代表目录shad</li>
<li>0&#x2013; “l” 代表软连接和硬连接</li>
<li>“b” 代表块设备文件</li>
<li>“c” 代表字符设备文件</li>
<li>“s” 代表套接字文件</li>
<li>“p" 代表命名管道文件</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgaa0e1f1" class="outline-4">
<h4 id="orgaa0e1f1"><span class="section-number-4">2.3.3.</span> 文件连接数</h4>
<div class="outline-text-4" id="text-2-3-3">
</div>
<ol class="org-ol">
<li><a id="orgc5629c6"></a>linux保存文件的方法<br />
<div class="outline-text-5" id="text-2-3-3-1">
<p>
linux使用的文件系统是一种基于inode的文件系统（索引节点），是所有类unix的文件系统核心，每一个新创建的的文件都会被分配一个inode，并且每个文件都有一个唯一的inode编号，可以将inode理解为一个指针，指向的是文件所在的磁盘中的物理位置。所有的文件属性也都保存在inode中，系统是通过inode来定位每一个文件的，而不是通过文件名。为提高文件系统的执行效率，访问过的文件的inode会被缓存在内存中。 
</p>

<p>
连接数这个属性就是inode的引用计数，增加这个引用计数的元应在于：linux允许一个文件拥有多个名字。 文件名只是相当于对inode的一次引用。在使用ln命令建立文件链接的时候，会增加文件的连接数（即引用计数）
</p>
</div>
</li>
<li><a id="org33ee9df"></a>ln命令创建文件连接<br />
<ol class="org-ol">
<li><a id="orgaa59144"></a>默认创建硬连接<br />
<div class="outline-text-6" id="text-2-3-3-2-1">
<p>
<b>注意</b>
</p>
<ol class="org-ol">
<li>硬连接的文件属性和目标文件完全相同，使用同一个inode，仅仅将inode的引用计数+1.</li>
<li>硬连接要求必须与目标文件在同一分区中</li>
</ol>
</div>
</li>
<li><a id="org0c44364"></a>ln -s xxx xxx  创建软连接（相当于快捷方式）<br />
<div class="outline-text-6" id="text-2-3-3-2-2">
<p>
<b>注意</b>
软连接的文件属性和目标文件完全不同，软连接要占据一个新的inode，即软连接是一个新的文件
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org5702b39" class="outline-4">
<h4 id="org5702b39"><span class="section-number-4">2.3.4.</span> 修改文件的属性和权限</h4>
<div class="outline-text-4" id="text-2-3-4">
</div>
<ol class="org-ol">
<li><a id="org6e47c0e"></a>修改文件所属用户组：<br />
<div class="outline-text-5" id="text-2-3-4-1">
<p>
chown [-R] username filename
</p>
</div>
</li>
<li><a id="org91b3189"></a>修改文件的权限：<br />
<div class="outline-text-5" id="text-2-3-4-2">
<p>
chmod命令
</p>
</div>
<ol class="org-ol">
<li><a id="org1311baf"></a>文字法修改权限：<br />
<ol class="org-ol">
<li><a id="org4e80b83"></a>四个字母：<br />
<div class="outline-text-7" id="text-2-3-4-2-1-1">
<ul class="org-ul">
<li>u：拥有者</li>
<li>g：所属组</li>
<li>o：其他用户</li>
<li>a：所有用户</li>
</ul>
</div>
</li>
<li><a id="orgd8fb03a"></a>三个操作符号：<br />
<div class="outline-text-7" id="text-2-3-4-2-1-2">
<ul class="org-ul">
<li>+ 代表怎家权限</li>
<li>- 代表去掉权限</li>
<li>= 表设定权限</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</li>
<li><a id="org74b9ddd"></a>深入文件权限<br />
<div class="outline-text-5" id="text-2-3-4-3">
<p>
Linux的文件权限不止是r、w、x，还包括s和t两个特殊权限，它们与系统的帐号和系统的进程相关。
</p>
</div>
<ol class="org-ol">
<li><a id="orgf0506fe"></a>s标记（SUID）<br />
<div class="outline-text-6" id="text-2-3-4-3-1">
<ul class="org-ul">
<li>s这个标记出现在文件拥有者的x权限位上，称为Set UID，简称SUID，SUID权限的功能
<ul class="org-ul">
<li>SUID仅对二进制程序有效;</li>
<li>执行者对于该程序具有x的可执行权限;</li>
<li>执行者仅在执行该程序的过程中有效;</li>
<li>执行者将具有该程序拥有者的权限（su具有SUID权限，该命令的拥有者是root，非root的执行者执行su时获得su的拥有者root用户的权限，即非root用户执行su后，获得了root用户的权限。 换句话说，具有SUID权限的命令，用户不需要使用sudo，直接执行，就能获得root权限的效果。</li>
</ul></li>
<li>s这个标记出现在文件所数组的x权限位上，成为Set GID，简称SGID</li>
</ul>
</div>
</li>
<li><a id="orge0125bc"></a>设置SUID<br />
<div class="outline-text-6" id="text-2-3-4-3-2">
<p>
使用u+s来设置SUID权限
</p>
</div>
</li>
<li><a id="org6148402"></a>t标记<br />
<div class="outline-text-6" id="text-2-3-4-3-3">
<p>
出现在其他用户的x权限位上，t权限的名称是Sticky Bit，简称SBIT，仅对目录有效，作用如下:
</p>
<ul class="org-ul">
<li>用户对此目录拥有w和x权限</li>
<li>当用户在此目录下创建了文件或目录，仅自己和root才有权利删除该文件。 实例如下：用户U在目录D下创建了文件F，若D拥有SBIT权限，那么仅有用户U和root能删除文件F。SBIT应用的典型例子是/tmp目录，这个目录允许任何用户在里面创建文件，但是为了避免创建的文件被其他用户删除，把tmp目录设置为SBIT 权限，使得自己创建的文件仅能让自己或root删除。</li>
</ul>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
