note/linux就是这个范儿.org
**** whereis
在数据库/var/lib/mlocate/中查询，这个数据库是linux系统自动创建的，包含本地所有文件的信息，并且每天通过自动执行updatedb命令更新一次。因为每天更新一次，所以whereis的搜索结果有时会不准确。

要获得准确的搜索结果，可以先手动执行updatedb。

*注意*
whereis只能搜索可执行文件、联机帮助文件和源代码文件，要获得更全面的搜索结果，可以使用locate命令。
**** locate 
和whereis命令类似，也是使用的相同的数据库
**** which
只搜索在$PATH环境变量中存在的路径。
**** find
*** 文件打包压缩
**** 解压缩tar包
tar -vxf filename
**** 压缩
tar -jcvf filename（j代表bz2压缩方式）
** 程序的执行问题
*** 执行程序的方法和多任务协调机制
直接在命令行输入程序名时，linux系统只会在$PATH环境变量所指定的那些路径中搜索对应的程序（windows会先搜索一下当前目录，在搜索$PATH所指定的目录），如果找不到就失败。如果要执行不在$PATH所指定的路径中的程序，必须使用相对路径或绝对路径，所以linux不能或忽略件的扩展名。
**** 管道
- 管道是linux系统提供的多任务协调机制的一种，应用十分广泛。
***** 管道的分类:
- 匿名管道（|）和命名管道（mkfifo）两种。
- 两种管道的共同特点：数据只能从管道的一端写入并从另一端读取，而且读出的顺序和写入的顺序是相同的。所以管道也叫做FIFO（First Input First Output）
***** 匿名管道和命名管道的区别：
匿名管道不记名，随叫随用，属于零时工;命名管道需要分配固定的资源，有固定的岗位和资源
***** 管道小结
管道链接多个命令，按照先后顺序，一个一个的执行。 

**** I/O重定向
- I/O重定向也是linux提供的一种多任务协调机制
- I/O重定向的概念：把输出给A的东西重定向给了B，或者反过来说将要从A处获得的输入重定向到B处去获得了。
***** I/O重定向的分类
- 隐式重定向：发生在“匿名管道”中
- 显式重定向（>）：显示的指明将命令输出的屏幕的内容重定向到磁盘文件中
**** 任务的前后台切换
***** 切换到后台
———————————
执行命令:     tail -f /etc/profile\\
按下ctrl+z\\
屏幕上输出[1]+  stopped  tail -f /etc/profile\\
然后执行命令：bg\\
屏幕上显示：[1]+ tail -f  /etc/profile &\\
这表明我们刚才创建的前台任务切换到后台了。  \\
———————————
- 如果想直接创建后台任务，可以直接在命令末尾添加“&”符号来完成
如：tail -f /etc/bashrc &
***** 查看后台程序
使用jobs命令，得到任务号。带+的是默认任务。
***** 后台切换到前台
使用fg命令，fg后跟上jobs得到的任务，直接执行fg是切换默认任务。
***** 结束前台程序
ctrl+c
***** 结束后台程序
- 使用kill命令：kill -9 %任务号，如kill -9 %2
- kill命令是传递信号给具体的任务或进程，-9就是一个信号，这个信号会强制干掉一个不正常的任务或进程。
- kill默认发出的信号实际上是-15，这个信号使得程序正常退出
- kill最后的那个参数实际上是传递一个数字的进程ID，但是这与任务号冲突，所以要加上%来加以区分。
*** 计划任务
**** 了解 cron 概念

cron 守护进程是一个由实用程序和配置文件组成的小型子系统，在几乎所有类 UNIX 系统上都可以找到某种风格的 cron。cron 的组件包括守护进程本身；一组系统范围的配置文件；一组针对特定用户的配置文件；一个用来添加、修改和删除用户配置文件的实用程序；以及一个简单的访问控制设施。一般来说，cron 配置文件或 cron 作业的列表被称为 crontab 或 cron 时间表。

守护进程 cron 连续运行，每分钟检查一次配置文件中的修改。cron 读取系统范围的和针对用户的 crontab（分别在下面两段中详细说明）、相应地更新事件调度计划并执行这一分钟内应该执行的所有命令。这个守护进程还捕捉每个作业的输出（如果有输出的话），并把结果通过电子邮件发送给作业的所有者。

可以在三个位置定义与系统相关的 作业：/etc/crontab、/etc/cron.d 中的任何文件以及特殊目录 /etc/cron.hourly、/etc/cron.daily、/etc/cron.weekly 和 /etc/cron.monthly：

主要的系统 crontab 是/etc/crontab。这个文件有独特的语法（在下一节中讨论），其中定义的每个作业根据它自己的时间表（比如每小时两次或每天一次）作为指定的用户运行。使用 /etc/crontab 调度各种管理和维护任务。

还可以在 /etc/cron.d 目录中维护一组 crontab。通过创建 crontab，按照逻辑对属于某一子系统的命令进行分组。例如，PHP 5 编程语言的包在 /etc/cron.d 中安装一个名为 php5 的 crontab，它会定期清除不使用的会话。/etc/cron.d 中的文件采用与 /etc/crontab 相同的语法，每个作业按照自己的时间表并作为特定的用户运行。

还可以把 shell 脚本直接放在 /etc/cron.hourly、/etc/cron.daily、/etc/cron.weekly 或 /etc/cron.monthly 目录中，这样就可以每小时、每天、每周或每月运行此脚本一次。
　　crontab 仅仅是一个文本文件，可以用任何 UNIX 编辑器编辑它。它可以包含四种代码行：空行、注释、环境变量设置和命令。

***** 空行和注释

文件中的空行和多余的空格被忽略。空行和空格有助于提高 crontab 的可读性，使 crontab 组织有序。还可以使用注释对每个作业的时间表和用途加以说明。要想创建注释，只需在一行的开头加上一个井号（#）。

***** 环境变量和命令

cron 最终使用一个 shell 执行每个命令。可以通过环境变量修改或定制 shell 的行为。在 crontab 中很容易设置 shell 环境变量。只需输入 VARIABLE=value，把 VARIABLE 替换为变量名，把 value 替换为一个值。例如，crontab 行：
*PATH=/usr/bin:/bin:/usr/local/bin*

指定一个有序的目录列表作为 shell 搜索路径。

cron 预定义了五个环境变量：
1. PATH 的默认值是 /usr/bin:/bin。
2. SHELL 预设置为 /bin/sh。
3. LOGNAME 初始化为 crontab 所有者的用户名。
4. HOME 设置为 crontab 所有者的主目录，比如 /home/joe。
5. MAILTO 设置为 crontab 所有者的名称。
6. 要想修改这些默认值或设置任何变量，只需在 crontab 中设置适当的环境变量。

当然，crontab 可以包含任意数量的命令行。每个命令行指定一个频率、一个用户名（只对于系统 crontab）和一个要运行的任务。例如，命令：
*5 0 * * *　 root　 find /tmp -type f -empty -delete*
在每天 12:05 a.m（5 0 * * *）删除 /tmp 中的所有空文件和目录（find /tmp -type f -empty -delete）。此作业作为根用户（root）运行。

系统 crontab 命令必须指定一个用户名，作为运行此任务所用的用户。（因此，在 /etc/crontab 中可能看到上面的命令）。针对用户的 crontab 不能指定用户名；一个用户的 cron 命令总是作为这个用户运行。是否有用户名是系统 crontab 和用户 crontab 之间的惟一差异。

**** 下面讨论定制时间表的众多方式。
***** 定制时间表

cron 时间表允许以多种方式运行作业，比如每分钟或在特定日期的特定时间。调度的参数非常灵活。

cron 字段
可以通过五个字段调整频率：分、小时、月中日、月份和周中的日期（如周一，周二）。表 1 总结如何调整每个字段。

　　表 1. cron 作业的调度选项

 
位置 	字段 	值 	说明
1 	分 	0-59 	 
2 	小时 	0-23 	 
3 	月中日 	1-31 	与分和小时不同，月中日不是从零开始的。
4 	月份 	1-12 	月份也不是从零开始的。也可以不使用 1-12 的数字，而是使用月份名的前三个字母，比如 jan 或 may。
5 	周中日 	0-7 	0 和 7 都代表星期日。还可以使用名称的前三个字母，比如 mon 或 wed。

除了名称或数字之外，还可以使用星号（*）表示 “所有”。例如，在分钟位置上的星号表示这一天中的每一分钟。（在某些情况下确实需要如此高的频率，但是一定要小心，以这种频率执行的任务应该非常简单，不会长时间运行）。

还可以使用值的列表、范围和步长（增量）分别指定多个值、连续的值范围和不连续的值范围。甚至可以组合使用列表和范围。列表 是一个逗号分隔的值集。范围 由启始值和结束值（含）以及可选的步长值构成。

我们来看一些示例。表 2 中的每一行包含一个时间表及其说明。当分、小时和日期字段与当前时间匹配时，cron 会执行命令；如果月中日和周中日受到限制（也就是说，不是 *），那么当这两个字段中至少一个 与当前时间匹配时，cron 也会执行命令。

表 2. cron 作业的时间表示例

调度计划 	 
分 	小时 	月中日 	月份 	周中日期 	说明
0 	1 	15 	1,  3,  5,  7,  9,  11 	* 	在 1、3、5、7、9 和 11 月的 15 日的 1 a.m. 运行命令。为了更容易理解，也可以把这个时间表写成 0 1 15 jan,  mar,  may,  jul,  sep,  nov *。在指定列表时，不要在逗号后面加空格。
0-59/15 	* 	* 	* 	* 	这个调度计划每 15 分钟运行命令一次。
30 	* 	* 	* 	wed,  fri 	这个时间表只在星期三和星期五每小时的 30 分时执行命令一次。（在列表中可以使用日和月份的名称，但是在范围中不可以）。
0,  30 	0-5,  17-23 	* 	* 	* 	在午夜到 5 a.m. 以及 7 p.m. 到 11 p.m. 之间整点时和 30 分时运行命令。
0 	0 	1 	1 	* 	在每年 1 月 1 日午夜执行命令一次。
0 	0 	* 	* 	0 	在每个星期日午夜运行命令。这相当于每周一次。
30 	0 	10,  20,  30 	* 	6 	因为月中日和周中日受到限制，这个时间表在每星期六和每月的 10、20 和 30 日（二月除外）的 12:30 a.m. 运行命令。

如您所见，实际上可以使用这五个参数指定任何调度计划。为了更加简便，Vixie cron 还提供了常用调度计划的简写形式。表 3 列出一些简写形式。

表 3. 常用调度计划的简写形式

简写形式 	说明
@reboot 	每当计算机重新引导时运行命令。
@daily 	每天一次的简写形式。
@weekly 	每周一次的简写形式。
@annually 	每年一次的简写形式。也可以写成 @yearly。
@midnight 	在每天午夜运行命令。这个简写形式相当于 @daily。

如果喜欢使用简写形式，只需用它们替代 cron 命令的前五个字段。下面这个命令看起来简单多了。

@daily root /usr/local/scripts/clean_old_files.sh

**** crontab 命令示例

掌握了基本概念之后，我们来看一些用户 crontab 命令示例。同样的命令也可以应用系统范围：只需在所有系统 crontab 项中周中日字段（第五个字段）后面指定一个用户名。

