note/linux就是这个范儿.html
<li><a id="orge70a0b2"></a>创建个人 crontab<br />
<div class="outline-text-6" id="text-2-5-2-3-1">
<p>
　　要想创建个人 crontab，可以用任何文本编辑器创建一个文件。按照惯例，个人 crontab 文件保存在 ~/.crontab 中，但是可以使用任何文件名。
</p>

<p>
PATH=/usr/bin:/bin:/usr/local/bin
</p>

<p>
@daily　　　find $HOME -type f -name '.#*' -print -delete
　　
</p>

<p>
@weekly　　 du -sh $HOME
</p>

<p>
　　通过 crontab 实用程序提交个人 crontab
</p>

<p>
　　在编辑文件（比如 ~/mycrontab）之后，通过 crontab 实用程序把它提交给 cron：
</p>

<p>
% crontab ~/mycrontab
</p>

<p>
　　查看 cron 中存储的信息
</p>

<p>
　　要想查看 cron 中存储的信息，可以输入 crontab -l：
</p>

<p>
% crontab -l
PATH=/usr/bin:/bin:/usr/local/bin
　　
</p>

<p>
@daily　　　find $HOME -type f -name '.#*' -print -delete
</p>

<p>
@weekly　　 du -sh $HOME
</p>

<p>
　　替换 crontab
</p>

<p>
　　在任何时候，都可以使用 crontab 实用程序替换您的 crontab。只需提交一个新文件或同一文件的修订版。要想删除 crontab 作业，只需输入 crontab -r：
</p>

<p>
% whoami
joe
% crontab ~/mycrontab
% crontab -l
PATH=/usr/bin:/bin:/usr/local/bin
&#x2026;
% crontab -r
% crontab -l
crontab: no crontab for joe
</p>

<p>
　　替代 cron 的机制
</p>

<p>
　　尽管 cron 确实很有用，但是您还应该了解可以替代它的两种机制。
</p>

<p>
　　anacron
</p>

<p>
　　如果系统常常关机或进入休眠状态（例如，如果使用 UNIX 笔记本计算机的话），那么可以考虑在系统中添加 anacron。anacron 与 cron 的相似之处在于，它也把作业安排在以后运行；但是，与 cron 不同，即使作业的预定运行时间已经过了，anacron 也会运行作业。
</p>

<p>
　　例如，如果安排在星期六运行文件系统备份，但是系统在星期五到星期一关机了，那么当系统在星期一重新启动时，anacron 会立即运行星期六的作业。与之相反，cron 仅仅检查现在是否应该运行作业；因此，如果在作业的预定运行时间系统是关闭的，就不运行作业。
</p>

<p>
　　anacron 的调度选项比 cron 少得多。它只能以整天的时间间隔调度作业，比如一天、7 天或 30 天；但是对于那些必须频繁且可靠地运行的作业，它是更好的选择。
</p>

<p>
　　另外，必须从 cron 启动 anacron。每当 anacron 运行时，它读取自己的配置文件。配置文件包含由作业及其频率（用天数表示）组成的配置对。如果作业在预定的时间没有运行，anacron 就运行此作业并记录运行作业的时间。运行完所有作业之后，anacron 退出。
</p>

<p>
　　在大多数 Linux 发行版上都可以找到 anacron，但是也很容易自己下载并构建源代码。访问 anacron 项目页面 获得最新版本。
</p>

<p>
　　anacron 的主要配置文件可以在 /etc/anacron 中找到。可以像配置 cron 时那样设置环境变量，但是更简单：
</p>

<p>
SHELL=/bin/zsh
PATH=/usr/bin:/bin:/usr/local/bin
</p>

<p>
1 10 day-to-day daily.chores.sh
</p>

<p>
　　第一个数字是周期，所以 1 表示每天运行一次，7 表示每 7 天运行一次，等等。第二个数字是延迟，也就是从 anacron 启动之后到执行这个作业之间等待的分钟数。如果把延迟字段设置为不同的值，就可以防止所有作业同时启动。名称 day-to-day 只是一个有帮助的昵称。配置行的其余部分指定作业；在这里，每天运行在指定路径中找到的 shell 脚本 daily.chores.sh 一次。
</p>

<p>
　　anacron 以手册页形式提供了出色的文档，还可以在网上找到关于 anacron 的提示。（请阅读我在 2007 年 10 月编辑的 Rod Smith 撰写的 Linux Magazine 文章）。anacron 适合 UNIX 爱好者和需要额外保障的系统管理员使用。
</p>

<p>
　　launchd：cron 的现代替代机制
</p>

<p>
　　cron 确实是一种功能强大、值得信赖的实用程序，它的广泛流行就证明了这一点。Vixie cron 最近又有所改进，比如增加了简写方式 @reboot，进一步简化了管理。但是，cron 仍然有一些缺点：
</p>

<p>
　　尽管可以在 crontab 文件中定义 cron 作业，但是不能从命令行启动和停止 cron 作业。另外，不能在命令行上创建专用作业并提交给日历。
</p>

<p>
　　cron 不实施资源限制。如果作业作为根用户运行，就能够消耗无数的处理器时间和内存。在实践中，可能希望限制一个作业，以免它影响其他 cron 作业和系统操作的总体质量。
</p>

<p>
　　cron 作业严格地与一个调度计划相关联。例如，无法只在发生某一事件（比如创建一个文件）时启动作业。
</p>

<p>
　　从更大的范畴来看，类 UNIX 系统的许多核心组件都能够根据需要启动其他程序，包括 cron、用于网络守护进程的 xinetd（或 inetd）和 init（所有系统进程的起源）。每个核心组件都有自己的配置文件，所以很难知道哪个组件最适合完成某个修改。
</p>

<p>
　　为了克服这些缺点，Apple Computer 开发了一个统一的启动工具 launchd，它可以在引导时、根据需要和按照指定的时间间隔启动进程。实际上，在 Mac OS 10.4 Tiger 中 launchd 已经替代了 cron（和 init 以及用来引导和初始化系统的其他几个系统实用程序）。（Apple 在系统上保留了 cron，以便为用户提供方便，而且 Vixie cron 的调度选项更灵活）。Mac OS X 的引导速度很快确实可以归功于 launchd：它会在引导时列出要启动的程序，但是只在首次需要时执行程序。
</p>

<p>
　　launchd 是开放源码的，可以从 Mac OS Forge 上它的主页获得源代码。目前，launchd 已经被移植到 FreeBSD 上，但是还没有移植到其他 UNIX 或 Linux 系统。但是，许多项目正在积极地实现与 launchd 等效的程序，所以简要地了解它的特性是有必要的：
</p>

<p>
　　launchd 并不创建作业来检查目录中是否有新文件，而是自动监视目录中是否有新文件或者监视空目录中是否添加了任何文件，并根据需要启动作业。launchd 不执行轮询；而是使用 kqueues 设施让内核在目录发生变化时通知它。（Linux 具有一种相似的事件设施 inotify，以后的一篇 developerWorks 文章将讨论它） 。
</p>

<p>
　　如果指定了，launchd 会使用 chroot 把您的作业发送到一个新目录。chroot 读作 “cha-root”，它是一个系统调用，可以改变前向斜杠（/）和根目录指向的目录。因此，如果使用 chroot 把文件发送到 /opt/root，/opt/root 之外的所有文件就是不可访问的（毕竟，/opt/root 现在是 /，也就是文件系统的顶级目录），/opt/root 中的所有目录成为一级目录。通常使用 chroot 限制作业，使代码无法进入更大的文件系统，以避免产生损害。
</p>

<p>
　　可以为作业设置资源限制。可以限制的资源包括内存、堆栈大小和打开的文件的最大数量。
</p>

<p>
　　当定义一个任务并把它装载到 launchd 中之后，可以按照名称从命令行启动和停止作业。
</p>

<p>
　　launchd 由三个组件组成：launchd 守护进程本身；用来添加、修改和删除作业以及控制 launchd 的 launchctl 实用程序；一个或多个配置文件，每个文件定义一个或多个作业。由于它起源于 Mac OS X，launchd 配置文件只是简单的属性文件，可以用 Extensible Markup Language (XML) 表示。
</p>

<p>
　　简单地说，在 Mac OS X 上使用 launchd 的步骤如下（要监视一个目录中添加的文件并根据需要运行作业）：
</p>

<p>
　　创建一个属性文件来表达此作业及其所有属性。
</p>

<p>
　　可以使用 Mac 的 Property Editor，也可以手工编辑 XML。无论采用哪种方法，产生的文件都应该与 清单 1 相似。
</p>

<p>
　　清单 1. 监视文件系统目录变化的 launchd 作业示例
</p>

<p>
&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;!DOCTYPE plist PUBLIC "-//Apple Computer//DTD PLIST
　　　　　　1.0//EN" "<a href="http://www.apple.com/DTDs/PropertyList-1.0.dtd">http://www.apple.com/DTDs/PropertyList-1.0.dtd</a>"&gt;
&lt;plist version="1.0"&gt;
&lt;dict&gt;
　　&lt;key&gt;Label&lt;/key&gt;
　　&lt;string&gt;com.example.processor&lt;/string&gt;
　　&lt;key&gt;OnDemand&lt;/key&gt;
　　&lt;true/&gt;
　　&lt;key&gt;Program&lt;/key&gt;
　　&lt;string&gt;/Users/strike/bin/processor&lt;/string&gt;
　　&lt;key&gt;ProgramArguments&lt;/key&gt;
　　&lt;array&gt;
　　　　&lt;string&gt;processor&lt;/string&gt;
　　&lt;/array&gt;
　　&lt;key&gt;WatchPaths&lt;/key&gt;
　　&lt;array&gt;
　　　　&lt;string&gt;/Users/strike/data/incoming&lt;/string&gt;
　　&lt;/array&gt;
&lt;/dict&gt;
&lt;/plist&gt;
</p>

<p>
　　简单地说，当 /Users/strike/data/incoming 目录的内容发生变化时，此文件运行 /Users/strike/bin/processor 中的实用程序脚本。把 OnDemand 设置为 True 让 launchd 根据需要启动此作业。把此文件保存到 ~/Library/LaunchAgents/com.example.processor.plist。
</p>

<p>
　　用 launchctl 把此作业装载到 launchd 中：% launchctl load ~/Library/LaunchAgents/com.example.processor.plist
</p>

<p>
　　如果希望检查最近的操作或查看保存的作业的列表，只需输入 launchctl list。
</p>

<p>
　　要想删除作业，只需带 unload 选项使用 launchctl：% launchctl unload -w ~/Library/LaunchAgents/com.example.processor.plist
</p>

<p>
　　-w 的作用是什么？它完全删除 launchd 中的作业。如果没有这个选项，作业会在登录时自动地重新装载（因为作业还在启动代理的用户集合中）。
</p>

<p>
　　launchd 手册页包含大量信息；如果您是 Mac OS X 用户，还可以找到大量针对 launchd 的应用程序。一些聪明的开发人员正在把 launchd 迁移到更广泛的平台。
</p>

<p>
　　使用 cron 让工作更轻松
</p>

<p>
　　学习关于使用 cron 的一些提示和技巧，了解这个守护进程和相似的其他程序为什么是您的好朋友。
</p>

<p>
　　提示和技巧
</p>

<p>
　　下面是关于 cron 的一些提示、技巧和常见的问题：
</p>

<p>
　　与在终端窗口中使用的 shell 或 shell 脚本不同，cron 并不 在 crontab 文件中就地展开环境变量。换句话说，如果在 crontab 中输入：HOME=/home/joe
PATH=$HOME/bin:/usr/bin:/bin
</p>

<p>
　　那么 PATH 并不会设置为您期望的路径。您必须手工展开所有变量，比如：
</p>

<p>
HOME=/home/joe
PATH=/home/joe/bin:/usr/bin:/bin
</p>

<p>
　　但是，因为每个 cron 命令都由 shell 执行，所以命令可以 引用变量名。例如，如果在个人 crontab 中编写以下命令（注意这一行中省略了用户名参数）：
</p>

<p>
@daily　$HOME/bin/cleanup<sub>daily.sh</sub>
</p>

<p>
　　那么 $HOME 会正确地展开。
</p>

<p>
　　不要把计算密集型任务安排在同一时间启动，比如 @midnight。如果可能的话，在凌晨的几小时中分散地启动这些任务，以避免它们争用资源。
</p>

<p>
　　正如上面提到的，在默认情况下环境变量 SHELL 设置为 /bin/sh。如果不修改此变量，crontab 中的所有命令都由 /bin/sh 解释。但是，如果您不熟悉 /bin/sh，更喜欢另一种 shell，那么可以设置 SHELL 并使用这种 shell 的命令语法。
</p>

<p>
　　例如，如果设置 SHELL=/bin/zsh，那么所有命令都可以使用 Z shell 的功能，比如它的高级重定向操作符：
</p>

<p>
SHELL=/bin/zsh
@daily　uptime &gt; daily &gt;&gt; weekly
</p>

<p>
　　在这里，uptime 命令的输出覆盖 daily 文件（&gt;daily）并追加到 weekly 文件中（&gt;&gt; weekly）。
</p>

<p>
　　使用访问控制列表 (ACL) — /etc/cron.allow 和 /etc/cron.deny — 允许或拒绝特定用户运行 cron 作业。如果希望把对 cron 的访问权限制在很少几个用户，那么在 /etc/cron.allow 中列出这些用户的用户名。未指定的任何用户都无法使用 crontab 实用程序提交 crontab。但是，如果希望允许大多数人访问 cron 而拒绝少数用户，那么在 /etc/cron.deny 中列出受到限制的用户。
</p>

<p>
　　例如，如果 /etc/cron.allow 的内容如下：
</p>

<p>
joe
zelda
</p>

<p>
　　那么除 Joe 和 Zelda 之外任何用户都无法访问 cron：
</p>

<p>
% whoami
strike
% crontab ~/.crontab
You (strike) are not allowed to use this program (crontab)
See crontab(1) for more information
</p>

<p>
　　要想禁用 cron 发出的电子邮件报告，应该在 crontab 中设置 MAILTO=""。
</p>

<p>
　　再次重申，不要在列表中使用空格。列表值以逗号分隔。在 Vixie cron 中，在范围中不使用日和月份的名称。
</p>

<p>
　　要仔细阅读系统的 cron 文档。路径、特性和简便措施都可能不一样。在命令行上输入 man 5 crontab 了解 crontab 文件的语法。输入 man 1 crontab 了解 crontab 实用程序。在命令行上输入 man cron 或 man 8 cron 了解 cron 守护进程本身的选项。
</p>

<p>
　　系统管理员最好的朋友
</p>

<p>
　　cron 和与它相似的程序对于系统管理员非常有帮助。如果您需要反复执行相同任务，就可以考虑用 cron 实现自动化。捕捉具有许多步骤的复杂任务常常需要 shell 脚本，但是许多任务只需要一行命令。
</p>

<p>
　　下面仅仅是一些思路：
</p>

<p>
　　通过组合使用 cron 和数据库工具，创建每日转储。例如，命令：@daily joe mysqldump -pjoespwd accounts &gt; $HOME/backups/accounts.`date +%F`.sql
</p>

<p>
　　每天把数据库 accounts 转储到一个文件。嵌入的日期命令（`date +%F`）确保文件名是惟一的，比如 accounts.2008-08-07.sql。此命令作为用户 joe 运行，所以用 -p 指定 Joe 的密码。此命令还可以放在 Joe 自己的 crontab 中，因为转储需要他的 MySQL 凭证。
</p>

<p>
　　locate 子系统为系统上的所有文件编制索引，并把每个文件的完整路径存储在数据库中。然后，从命令行查询此数据库，就可以立即找到文件。当然，可以根据需要用 find 搜索文件，但是必须等待它搜索文件系统，这可能很慢。
</p>

<p>
　　为了让定位子系统发挥作用，必须定期为文件系统编制索引，因为随时可能添加和删除文件。这种情况就非常适合使用 cron。
</p>

<p>
0 0,  12 * * * root updatedb
</p>

<p>
　　这个 crontab 项每天运行 updatedb（locate 更新实用程序）两次。
</p>

<p>
　　显然很适合用 cron 实现自动化的另一个任务是，把文件从主服务器复制到众多的从服务器。rsync 是一种跨多个系统分布和同步文件集合的现代实用程序。许多网管都通过组合使用 cron 和 rsync 把网站的主拷贝复制到服务器群中的每台服务器。@midnight www rsync -avz /var/www/site slave1:/var/www
</p>

<p>
　　在每天午夜，rsync 都会把 /var/www/site 复制（-avz）到 slave1 上的 /var/www。
</p>

<p>
　　使用命令行实用程序 mail 和 shell 管道操作符（|）把任务的输出发送给团队中的一个或多个成员。
</p>

<p>
@weekly root df &#x2013;print-type &#x2013;local -h |&amp; mail -s "Weekly df report" andy bob
</p>

<p>
　　在这里，每周通过电子邮件把 df 的输出发送给用户 Andy 和 Bob，让他们能够监视磁盘使用量。
</p>

<p>
　　结束语
</p>

<p>
　　教程结束语
</p>

<p>
　　无论您是单独使用 UNIX 系统，还是管理有数百位用户的系统，自动执行维护任务都有助于节省时间、减少错误以及保持机器不间断运行。cron 是在 UNIX 系统上实现自动化的关键组件，只需发挥一点儿想像力，就可以让计算机为您工作，而不是由您 “伺候” 计算机。
　　cron 有助于更轻松地完成工作。现在，您可以睡个好觉了。
</p>
</div>
</li>
</ol>
</li>
