note/linux就是这个范儿.org
**** 计划任务的分类
- 一次性
- 周期性
**** 一次性计划任务
- 使用at命令，每次执行at命令需要给他一个时间参数，如：at 10：00 tomorrow，这条命令要求明天早上10点整执行一个程序。
- 执行at命令后，命令行会变成： at > ，此时，只要直接输入想要执行的命令即可。输入玩命令后，按组合键ctrl+D来保存。然后就会立即显示类似这样的内容：
job 1 at 2016-3-12 10：00
**** 周期性任务（cron）
- 铜鼓crontab命令来完成，crontab -e 编辑当前用户的cron表
***** cron任务的完整定义
*分钟 小时 日 月 周 [用户名] 命令*
***** cron时间符号
| 符号 | 含义                                                 |
|------+------------------------------------------------------|
| *    | 代表任意时间                                         |
| ，   | 代表分隔出不连续的时间点，比如2，3，表示2点和3点都行 |
| -    | 代表连续的时间段，比如2-4表示2、3、4                 |
| */n  | 表示每隔单位时间                                     |
|      |                                                      |
*** 守护进程及其作用（daemons）
**** 守护进程的分类
- 独立启动的stand alone
自行启动，不需要利用系统其他机制来管理，启动只后会一直占用系统哦嗯资源和内存。\\

有一个最突出的优点：响应最快。

stand alone守护进程非常多，如常见的apache、mysql等。
- xinetd
新型的守护进程，由一个统一的stand alone守护进程来负责唤起，这个特殊的守护进程叫super daemon。

这是一种按需分配的进程服务，只有当客户端有要求时，super daemon才会去唤醒具体的xinetd守护进程

缺点：不能及时响应。\\
优点：赋予super daemon安全管控的机制，类似防火墙功能
**** stand alone守护进程的启动脚本的目录
/etc/init.d/目录下  
***** stand alone守护进程的常用命令选项：
- start
- stop
- restart
**** xinetd守护进程的配置文件
- /etc/xinetd.d目录下和/etc/xinetd.conf文件中。一般不用关心xinetd.conf文件的内容。/etc/xinetd.d中的每个文件代表一个独立的xinetd守护进程。
*** 全面了解程序信息
**** ps命令（截取某个时间点的程序状态，是静态数据）
*ps命令的三种常见用法*
1. ps aux 查看系统中所有程序的数据;
2. ps ux  查看当前用户所有程序的数据;
3. ps -l  查看与当前终端关联的程序数据;
***** ps -l命令输出的各个字段的说明
- F:程序标志，代表程序的执行权限，常见取值有：0（普通权限）;4（root
权限）;1（此程序仅执行了fork而没有执行exec。
- S：代表程序状态,  R:运行中;S：睡眠状态，可唤醒;D：不可被唤醒状态，一般实在等待I/O;T：停止状态，比如被调试的时候;Z：僵尸状态，程序已经终止，但是却无法把它移出内存。
- UID：代表词进程拥有者的UID。
- PID：代表此进程的进程ID。
- PPID：此进程的父进程ID。
- C：cpu的使用率，单位为百分比。
- PRI：运行优先级。
- NI：运行优先级调整。
- ADDR：指出该程序在内存的哪个部分，如果是个running程序，一般显示“-”。
- SZ：此程序用掉的内存。
- WCHAN：表示目前程序是否运行中，若为“-”表示正在运行。
- TTY：登录者的终端机位置。
- TIME：使用掉的cpu时间，不是系统时间。
- CMD：这个代表程序名称，这里的cmd是command命令终端程序。
**** top（每5秒刷新一次的系统负载）
**** pstree 查看进程的父子祖先关系
** 软件的安装
*** 从源码安装
因为不确定源码中是否包含上次编译过的目标文件（(*.o），最好先用make clean 或make distclean去除目标文件，以保证新编译出来的可执行文件是在自己的机器上编译完成的。
- 第一步：configure（生成makefile文件)
- 第二步：make
- 第三步：make install

源码安装的缺点：没有做软件相关性检查，会导致它依赖的其他软件不存在或者版本不准确，从而有可能无法正常运行。
*** 利用软件管理工具rpm和dpkg
|      | RPM                                                            | DPKG                                                              |
|------+----------------------------------------------------------------+-------------------------------------------------------------------|
|      | red hat包管理器                                                | debian软件包管理器                                                |
| 安装 | rpm -ivh <软件包名>                                            | dpkg -i <软件包名>                                                |
| 查询 | rpm -qa ×××*;查找此软件像系统写入的文件：rpm -ql <软件包名> | dpkg -l ×××*;查询系统中属于xxx软件的文件：dpkg --listfiles xxx |
| 卸载 | rpm -e <软件名>                                                | dpkg -e <软件名>                                                     |
*** 在线安装机制
- dpkg管理机制的apt在线安装/升级
- rpm的yum/you/urpm等在线安装/升级
**** apt/yum等在线安装机制的意义
- dpkg/rpm等的弊端：没有完全解决软件属性相依的问题，无法避免软件包的依赖问题。
- apt/yum等的优势：获取软件包的依赖，通过网络自动的下载安装，从而解决软件包的依赖问题。
**** 操作
|      | yum                                                                                                                                                                     | apt                                                                                                                                                              |
|      |                                                                                                                                                                         |                                                                                                                                                                  |
|------+-------------------------------------------------------------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------|
| 安装 | yum install package_name                                                                                                                                                | apt-get install package                                                                                                                                          |
| 升级 | yun update package                                                                                                                                                      | apt-get update（刷新软件源，建立跟新软件列表）;apt-get upgrade（一次性升级所有软件包）                                                                           |
| 卸载 | yun remove package                                                                                                                                                      | apt-get remove package; apt-get purge remove package（清除软件包的同时清除配置，彻底删除）                                                                       |
| 查询 | 1. yun search keyword（查询软件包） 2. yum list installed（列出已经安装的软件包） 3. yum info package（获取软件包信息） 4. yum provides package（列出软件包提供的文件） | 1. apt-cache search keyword（查找软件包） 2. apt-cache show package（获取制定软件包的详细信息） 3. apt-cache showpkg package（获取软件包版本和软件包的依赖关系） |
| 清除缓存 | yum clean headers（清除header）;yum clean package（清除下载的rpm包）; yum clean all（清除缓存的软件包和旧的headers）                                                    | apt-get clean（清除整个软件包缓冲区）; apt-get autocelan（按照依赖关系清理缓冲区中多余的软件包）                                                                                                 |
** 磁盘的管理方式
*** linux的文件系统
ExtN（N=2、3、4）
*** 磁盘的基本操作
最常用的：df、du、dd、fsck、mountdf：
**** df
查看系统中所有磁盘的整体使用量;
**** du
查看目录的容量，执行效率比df差很多;
**** dd
把一个目录完整copy到另一个目录，可以制作系统u盘镜像。
***** 用法：
dd if=input_file of=out_file

if和out这两个参数可以不用给定，有默认值。if的默认值是标准输入，of的默认值是标准输出（相当于cat命令，即在屏幕上显示文件）

通过bs和count这两个参数，能够指定读写的字节数和读写次数
