note/linux就是这个范儿.html
<li><a id="org98d8f5d"></a>计划任务的分类<br />
<div class="outline-text-5" id="text-2-5-2-4">
<ul class="org-ul">
<li>一次性</li>
<li>周期性</li>
</ul>
</div>
</li>
<li><a id="org0edc989"></a>一次性计划任务<br />
<div class="outline-text-5" id="text-2-5-2-5">
<ul class="org-ul">
<li>使用at命令，每次执行at命令需要给他一个时间参数，如：at 10：00 tomorrow，这条命令要求明天早上10点整执行一个程序。</li>
<li>执行at命令后，命令行会变成： at &gt; ，此时，只要直接输入想要执行的命令即可。输入玩命令后，按组合键ctrl+D来保存。然后就会立即显示类似这样的内容：</li>
</ul>
<p>
job 1 at 2016-3-12 10：00
</p>
</div>
</li>
<li><a id="org604e72c"></a>周期性任务（cron）<br />
<div class="outline-text-5" id="text-2-5-2-6">
<ul class="org-ul">
<li>铜鼓crontab命令来完成，crontab -e 编辑当前用户的cron表</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org4449c65"></a>cron任务的完整定义<br />
<div class="outline-text-6" id="text-2-5-2-6-1">
<p>
<b>分钟 小时 日 月 周 [用户名] 命令</b>
</p>
</div>
</li>
<li><a id="orgf16fbe8"></a>cron时间符号<br />
<div class="outline-text-6" id="text-2-5-2-6-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">符号</th>
<th scope="col" class="org-left">含义</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">*</td>
<td class="org-left">代表任意时间</td>
</tr>

<tr>
<td class="org-left">，</td>
<td class="org-left">代表分隔出不连续的时间点，比如2，3，表示2点和3点都行</td>
</tr>

<tr>
<td class="org-left">-</td>
<td class="org-left">代表连续的时间段，比如2-4表示2、3、4</td>
</tr>

<tr>
<td class="org-left">*/n</td>
<td class="org-left">表示每隔单位时间</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org20cdd0c" class="outline-4">
<h4 id="org20cdd0c"><span class="section-number-4">2.5.3.</span> 守护进程及其作用（daemons）</h4>
<div class="outline-text-4" id="text-2-5-3">
</div>
<ol class="org-ol">
<li><a id="org0fd2cf1"></a>守护进程的分类<br />
<div class="outline-text-5" id="text-2-5-3-1">
<ul class="org-ul">
<li>独立启动的stand alone</li>
</ul>
<p>
自行启动，不需要利用系统其他机制来管理，启动只后会一直占用系统哦嗯资源和内存。<br />
</p>

<p>
有一个最突出的优点：响应最快。
</p>

<p>
stand alone守护进程非常多，如常见的apache、mysql等。
</p>
<ul class="org-ul">
<li>xinetd</li>
</ul>
<p>
新型的守护进程，由一个统一的stand alone守护进程来负责唤起，这个特殊的守护进程叫super daemon。
</p>

<p>
这是一种按需分配的进程服务，只有当客户端有要求时，super daemon才会去唤醒具体的xinetd守护进程
</p>

<p>
缺点：不能及时响应。<br />
优点：赋予super daemon安全管控的机制，类似防火墙功能
</p>
</div>
</li>
<li><a id="org9e21af3"></a>stand alone守护进程的启动脚本的目录<br />
<div class="outline-text-5" id="text-2-5-3-2">
<p>
/etc/init.d/目录下  
</p>
</div>
<ol class="org-ol">
<li><a id="org0ac90a3"></a>stand alone守护进程的常用命令选项：<br />
<div class="outline-text-6" id="text-2-5-3-2-1">
<ul class="org-ul">
<li>start</li>
<li>stop</li>
<li>restart</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="org70dae4c"></a>xinetd守护进程的配置文件<br />
<div class="outline-text-5" id="text-2-5-3-3">
<ul class="org-ul">
<li>/etc/xinetd.d目录下和/etc/xinetd.conf文件中。一般不用关心xinetd.conf文件的内容。/etc/xinetd.d中的每个文件代表一个独立的xinetd守护进程。</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org9dfefc1" class="outline-4">
<h4 id="org9dfefc1"><span class="section-number-4">2.5.4.</span> 全面了解程序信息</h4>
<div class="outline-text-4" id="text-2-5-4">
</div>
<ol class="org-ol">
<li><a id="org91b76b3"></a>ps命令（截取某个时间点的程序状态，是静态数据）<br />
<div class="outline-text-5" id="text-2-5-4-1">
<p>
<b>ps命令的三种常见用法</b>
</p>
<ol class="org-ol">
<li>ps aux 查看系统中所有程序的数据;</li>
<li>ps ux  查看当前用户所有程序的数据;</li>
<li>ps -l  查看与当前终端关联的程序数据;</li>
</ol>
</div>
<ol class="org-ol">
<li><a id="orgddc3903"></a>ps -l命令输出的各个字段的说明<br />
<div class="outline-text-6" id="text-2-5-4-1-1">
<ul class="org-ul">
<li>F:程序标志，代表程序的执行权限，常见取值有：0（普通权限）;4（root</li>
</ul>
<p>
权限）;1（此程序仅执行了fork而没有执行exec。
</p>
<ul class="org-ul">
<li>S：代表程序状态,  R:运行中;S：睡眠状态，可唤醒;D：不可被唤醒状态，一般实在等待I/O;T：停止状态，比如被调试的时候;Z：僵尸状态，程序已经终止，但是却无法把它移出内存。</li>
<li>UID：代表词进程拥有者的UID。</li>
<li>PID：代表此进程的进程ID。</li>
<li>PPID：此进程的父进程ID。</li>
<li>C：cpu的使用率，单位为百分比。</li>
<li>PRI：运行优先级。</li>
<li>NI：运行优先级调整。</li>
<li>ADDR：指出该程序在内存的哪个部分，如果是个running程序，一般显示“-”。</li>
<li>SZ：此程序用掉的内存。</li>
<li>WCHAN：表示目前程序是否运行中，若为“-”表示正在运行。</li>
<li>TTY：登录者的终端机位置。</li>
<li>TIME：使用掉的cpu时间，不是系统时间。</li>
<li>CMD：这个代表程序名称，这里的cmd是command命令终端程序。</li>
</ul>
</div>
</li>
</ol>
</li>
<li><a id="orgcec9463"></a>top（每5秒刷新一次的系统负载）<br /></li>
<li><a id="org61e3ff1"></a>pstree 查看进程的父子祖先关系<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org98b55ff" class="outline-3">
<h3 id="org98b55ff"><span class="section-number-3">2.6.</span> 软件的安装</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgd29d6c6" class="outline-4">
<h4 id="orgd29d6c6"><span class="section-number-4">2.6.1.</span> 从源码安装</h4>
<div class="outline-text-4" id="text-2-6-1">
<p>
因为不确定源码中是否包含上次编译过的目标文件（(*.o），最好先用make clean 或make distclean去除目标文件，以保证新编译出来的可执行文件是在自己的机器上编译完成的。
</p>
<ul class="org-ul">
<li>第一步：configure（生成makefile文件)</li>
<li>第二步：make</li>
<li>第三步：make install</li>
</ul>

<p>
源码安装的缺点：没有做软件相关性检查，会导致它依赖的其他软件不存在或者版本不准确，从而有可能无法正常运行。
</p>
</div>
</div>
<div id="outline-container-org0175d56" class="outline-4">
<h4 id="org0175d56"><span class="section-number-4">2.6.2.</span> 利用软件管理工具rpm和dpkg</h4>
<div class="outline-text-4" id="text-2-6-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">RPM</th>
<th scope="col" class="org-left">DPKG</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">red hat包管理器</td>
<td class="org-left">debian软件包管理器</td>
</tr>

<tr>
<td class="org-left">安装</td>
<td class="org-left">rpm -ivh &lt;软件包名&gt;</td>
<td class="org-left">dpkg -i &lt;软件包名&gt;</td>
</tr>

<tr>
<td class="org-left">查询</td>
<td class="org-left">rpm -qa ×××*;查找此软件像系统写入的文件：rpm -ql &lt;软件包名&gt;</td>
<td class="org-left">dpkg -l ×××*;查询系统中属于xxx软件的文件：dpkg &#x2013;listfiles xxx</td>
</tr>

<tr>
<td class="org-left">卸载</td>
<td class="org-left">rpm -e &lt;软件名&gt;</td>
<td class="org-left">dpkg -e &lt;软件名&gt;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org4277936" class="outline-4">
<h4 id="org4277936"><span class="section-number-4">2.6.3.</span> 在线安装机制</h4>
<div class="outline-text-4" id="text-2-6-3">
<ul class="org-ul">
<li>dpkg管理机制的apt在线安装/升级</li>
<li>rpm的yum/you/urpm等在线安装/升级</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org6452737"></a>apt/yum等在线安装机制的意义<br />
<div class="outline-text-5" id="text-2-6-3-1">
<ul class="org-ul">
<li>dpkg/rpm等的弊端：没有完全解决软件属性相依的问题，无法避免软件包的依赖问题。</li>
<li>apt/yum等的优势：获取软件包的依赖，通过网络自动的下载安装，从而解决软件包的依赖问题。</li>
</ul>
</div>
</li>
<li><a id="org8659d15"></a>操作<br />
<div class="outline-text-5" id="text-2-6-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">yum</th>
<th scope="col" class="org-left">apt</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">安装</td>
<td class="org-left">yum install package<sub>name</sub></td>
<td class="org-left">apt-get install package</td>
</tr>

<tr>
<td class="org-left">升级</td>
<td class="org-left">yun update package</td>
<td class="org-left">apt-get update（刷新软件源，建立跟新软件列表）;apt-get upgrade（一次性升级所有软件包）</td>
</tr>

<tr>
<td class="org-left">卸载</td>
<td class="org-left">yun remove package</td>
<td class="org-left">apt-get remove package; apt-get purge remove package（清除软件包的同时清除配置，彻底删除）</td>
</tr>

<tr>
<td class="org-left">查询</td>
<td class="org-left">1. yun search keyword（查询软件包） 2. yum list installed（列出已经安装的软件包） 3. yum info package（获取软件包信息） 4. yum provides package（列出软件包提供的文件）</td>
<td class="org-left">1. apt-cache search keyword（查找软件包） 2. apt-cache show package（获取制定软件包的详细信息） 3. apt-cache showpkg package（获取软件包版本和软件包的依赖关系）</td>
</tr>

<tr>
<td class="org-left">清除缓存</td>
<td class="org-left">yum clean headers（清除header）;yum clean package（清除下载的rpm包）; yum clean all（清除缓存的软件包和旧的headers）</td>
<td class="org-left">apt-get clean（清除整个软件包缓冲区）; apt-get autocelan（按照依赖关系清理缓冲区中多余的软件包）</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orgd051e16" class="outline-3">
<h3 id="orgd051e16"><span class="section-number-3">2.7.</span> 磁盘的管理方式</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-orgd4fb8bd" class="outline-4">
<h4 id="orgd4fb8bd"><span class="section-number-4">2.7.1.</span> linux的文件系统</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
ExtN（N=2、3、4）
</p>
</div>
</div>
<div id="outline-container-org06a6d4f" class="outline-4">
<h4 id="org06a6d4f"><span class="section-number-4">2.7.2.</span> 磁盘的基本操作</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
最常用的：df、du、dd、fsck、mountdf：
</p>
</div>
<ol class="org-ol">
<li><a id="org33566b4"></a>df<br />
<div class="outline-text-5" id="text-2-7-2-1">
<p>
查看系统中所有磁盘的整体使用量;
</p>
</div>
</li>
<li><a id="org0f5e7f9"></a>du<br />
<div class="outline-text-5" id="text-2-7-2-2">
<p>
查看目录的容量，执行效率比df差很多;
</p>
</div>
</li>
<li><a id="org485ef32"></a>dd<br />
<div class="outline-text-5" id="text-2-7-2-3">
<p>
把一个目录完整copy到另一个目录，可以制作系统u盘镜像。
</p>
</div>
<ol class="org-ol">
<li><a id="orgf763e88"></a>用法：<br />
<div class="outline-text-6" id="text-2-7-2-3-1">
<p>
dd if=input<sub>file</sub> of=out<sub>file</sub>
</p>

<p>
if和out这两个参数可以不用给定，有默认值。if的默认值是标准输入，of的默认值是标准输出（相当于cat命令，即在屏幕上显示文件）
</p>

<p>
通过bs和count这两个参数，能够指定读写的字节数和读写次数
</p>
</div>
</li>
