note/linux就是这个范儿.org
***** dd应用举例 
dd1. dd if=/etc/bashrc  —— 缺省of，作用是把/etc/bashrc文件的内容在屏幕上显示。
2. dd if=/dev/sda1 of=./sda1.img  —— 制作磁盘1第一个分区的镜像文件。
3. dd if=/dev/sda1 |gzip -9 > ./sda1.img —— 备份sda1,  并压缩，然后写入镜像。
4. dd if=/dev/sda | gzip -9 > ./sda.img ——备份整个磁盘
5. gzip -dc ./sda.img |dd of=/dev/sda —— 恢复磁盘
6. dd if=/dev/sda of=./mbr.img bs=512 count=1 —— 备份磁盘的住引导记录（磁盘的前512个字节，就是第一个扇区的内容，也就是启动扇区。
**** fsck（修复文件系统）
很少手工执行，基本上在系统启动阶段自动执行。使用方式：fsck -t 文件系统 设备名\\
比如：fsck -f -t ext3 /dev/sda3 (f参数表示强制检查，否则，在没有报错的系统中是不会检测的。）
**** mount（挂载）
用法：mount [-t 文件系统] 设备名称 挂载点
*注意*
对于挂载windows目录，文件系统参数不能省略。挂载extn目录，文件系统参数可以省略。

*eg.*
mount -t vfat /dev/sdb1 /data
mount -o loop /xxx.iso/ /mnt/xxx/   （挂在光盘镜像）
**** umount（卸载）
*用法*
umount /目录
**** fdisk（磁盘分区）
**** mkfs.*（格式化）
*取决于格式化成什么系统，比如要格式化为ext3，就应该是mkfs.ext3
*** /etc/fstab文件 —— 决定分区的连接
让各个磁盘的各个分区具体挂载到哪个目录是由/etc/fstab文件所决定的，所以这个文件非常重要，一旦损坏或丢失，系统将无法正常启动。
**** 创建交换分区swap
- fdisk 创建交换分区
- mkswap 格式化
**** 挂载swap分区
- swapon 挂载swap
- swapoff 卸载交换分区
**** 普通文件成为交换分区
eg. 创建一个1G的交换文件：\\
dd if=/dev/zero of=/tmp/swap bs=1M count=1024 \\ 
(/dev/zero 是个空文件，这个dd命令的作用就是创建一个1G的空文件）
mkswap /tmp/swap\\
*** 逻辑卷
**** 什么是逻辑卷
***** 更换分区目录（如更换home目录分区）
- 划分更大的分区格式化为linux系统;
- 将原/home目录下的内容全部复制到新的分区;
- 修改/etc/fstab文件，让新的分区成为/home;
***** 逻辑卷的概念
能够弹性的调整文件系统的容量。理论上说，逻辑卷就是在磁盘分区和文件系统之间增加了一个逻辑层，当文件系统容量不够用时，可以向逻辑卷中增加新的分区来实现扩大容量的目的;而当发现文件系统过大而有磁盘浪费的时候，可以选择去除一些基本没有使用的磁盘分区来达到减少容量的目的。

在linux系统中，实现逻辑卷功能的是LVM，Logical Volume Manager，逻辑卷管理器
**** 基本属于和原理
***** Physical Volume，PV，物理卷
物理卷就是具体的磁盘分区，或者与磁盘分区有相同功能的设备，比如RAID。

PV是LVM的基本存储单元，与普通的磁盘分区相比，PV（物理卷）还要包含与LVM相关的管理参数
***** Volume Group，VG，卷组
卷组类似于非LVM系统中的物理磁盘，由多个物理卷组成，可以在卷组上创建一个或多个LVM分区
***** Physical Extend，PE，物理扩展区
每一个物理卷被进一步划分为被称为物理扩展区的基本单元，PE是LVM的最小存储区，与物理磁盘中的扇区或文件系统中的簇的概念基本相同。LVM的默认PE大小是4M，每个卷组最多仅能含有65534个PE。所以，一个卷组的最大容量就是4×65534=256G
***** Logical Volume，LV，逻辑卷
逻辑卷就是在卷组的基础上再进行切分，与在物理磁盘上继续划分分区是一样的道理，逻辑卷的大小必须是PE的整数倍。

需要增加容量，就增加PE，需要减少容量，就减少PE。这就是LVM能够弹性的调整容量的秘密。
**** 扩大和减小逻辑卷
*后续在研究*
** linux下的网络基础
*** 了解ip地址
（待记录……）
*** 相关配置文件
（
** sh相关知识
shell是命令行解释和执行器，是介于使用者和unix/linux操作系统核心程序（kernel）之间的一个接口。
*** bash
bash（bourne again shell）是linux下的经典shell，对bourne shell 做了向下兼容，融入了许多C shell和Korn shell的功能
**** bash的特点：
- 别名功能（alias）。
- 历史命令（history），默认显示500个历史命令。
- 工作控制（job control）

下面个几个命令控制进程的进行：

 + ps —— 列出正在运行的进程
 + kill —— 向一个或多个进程发信号（杀掉进程）
 + jobs —— 列出自己运行的进程
 + bg —— 将进程放到后台
 + fg —— 将进程放到前台
*** 环境变量
- 登陆系统后，shell启动，并从启动它的/bin/login程序中继承了多个变量、I/O流和进程特征。如果遇到需要后台处、执行整组命令及脚本的情况，父shell会派生子shell应付这些工作，子shell从父shell那里继承环境。这个环境包括进程的权限、工作目录、文件创建掩码、特殊变量、打开的文件和信号。

- 变量包括局部变量和环境变量，局部变量无法传递给子shell，环境变量可以一直传递下去。

- 环境变量包括：PATH、HOME、LOGNAME、IFS和SHELL. 环境变量一般大写

- 环境变量的设定：set、env、export

- 环境变量的清除：unset
*** bash的配置文件
- login shell：输入登陆用户名和密码后shell才启动。

- non-longin-shell：不需要做重复的登陆操作获取bash界面。
**** 系统配置文件
只有login shell才会读取系统配置文件/etc/profile，每个用户登陆bash后都会读取这个配置文件，如果想要设置的环境变量对所有的用户起作用，就要在这里设置
**** 用户个性配置文件
- login shell 读完了/etc/profile配置文件后，就会读取用户的个人配置文件，个人配置文件主要有三个home目录下的隐藏文件：
  1. ~/.bash_profile
  2. ~/.bash_login
  3. ~/.profile

- 如果1存在，那么bash不会读取2、3，如果1不存在，bash会读取2，如果1和2都不存在，那么bash会读取3。

- ~/.bashrc ： 如果这个文件存在，那么~/bash_profile还会调用它，哦哦们可以把一些环境设置写到该文件下。

- ~/.bash_history和~/.bash_logout
  - bash_history 保存命立的历史记录，每次登陆bash后，bash会读取这个文件，将所有的历史命令读入内存。
  - bash_logout 告诉系统在离开系统之前需要做的事情。默认情况下，文件只让bash清掉屏幕的信息。用户可以添加信息在这个文件中，例如备份等。
**** non-login shell的设置
详见p100
** 文本处理
*** 查看文本内容
查看文件的命令：
- cat
- more
- less
- head
- tail：tail可以实现不停的读取和显示文件内容，可以用于查看日志起到实时监控的作用。
*** 正则表达式
**** 正则表达式的基本要素：
- 表达式ε表示一个文本，包含一个长度为0的字符串，可以理解为{NULL}。通常将NULL记做ε。
- 表达式a表示仅有一个字符a的文本，即{a}
**** 正则表达式的三种基本运算规则：
- 并运算，记做X|Y，a|b={a，b}，相当于加法;
- 连接运算，记做XY，ab={ab}，X=a|b，Y=c|d，XY={ac，bc，ad，bd}，相当与乘法;
- 正则表达式的克林毕包，记做X* ,   表示将n个X与自己相连接，然后在就并，即X*=ε|X|XX|XXX|XXXX|……，a*={ε,  a,  aa,  aaa,  aaaa,  …………………}是一个无穷文本。
**** 运算的优先级
克林毕包>连接>并
**** 正则表达式的扩展运算
- [] 表示括号内的字符做并运算，同时支持范围描述符号“-”。[abcd]=a|b|c|d=[a-d]
- 普通字符“-”在[]中的描述。应为在[]中支持范围描述符“-”，如果要在[]使用字符“-”，需要将它放在[]中的开头或最后，如[-abc]=-|a|b|c,  [abc-]=a|b|c|-;
- []中以^开头，表示在字符集中排


除[]中的所有字符之后，所剩下字符的并运算，[^ab]表示对除了ab以外的所有字符求并。
- X？表示X|ε，代表X与空字符之间可选。
- X+表示XX*，这表示X至少要重复一次，即至少等于X
*** grep搜索文本
包含grep、egrep、fgrep。

egrep是grep的扩展支持跟多的正则表达式元字符

fgrep就是fixed grep或fast grep，只搜索字符，不使用正则表达式

gnu版的grep可以通过 -G、-E、-F命令选项来选择
