note/linux就是这个范儿.html
<li><a id="orgf835f50"></a>dd应用举例<br />
<div class="outline-text-6" id="text-2-7-2-3-2">
<p>
dd1. dd if=/etc/bashrc  —— 缺省of，作用是把/etc/bashrc文件的内容在屏幕上显示。
</p>
<ol class="org-ol">
<li>dd if=/dev/sda1 of=./sda1.img  —— 制作磁盘1第一个分区的镜像文件。</li>
<li>dd if=/dev/sda1 |gzip -9 &gt; ./sda1.img —— 备份sda1,  并压缩，然后写入镜像。</li>
<li>dd if=/dev/sda | gzip -9 &gt; ./sda.img ——备份整个磁盘</li>
<li>gzip -dc ./sda.img |dd of=/dev/sda —— 恢复磁盘</li>
<li>dd if=/dev/sda of=./mbr.img bs=512 count=1 —— 备份磁盘的住引导记录（磁盘的前512个字节，就是第一个扇区的内容，也就是启动扇区。</li>
</ol>
</div>
</li>
</ol>
</li>
<li><a id="org3b91b90"></a>fsck（修复文件系统）<br />
<div class="outline-text-5" id="text-2-7-2-4">
<p>
很少手工执行，基本上在系统启动阶段自动执行。使用方式：fsck -t 文件系统 设备名<br />
比如：fsck -f -t ext3 /dev/sda3 (f参数表示强制检查，否则，在没有报错的系统中是不会检测的。）
</p>
</div>
</li>
<li><a id="org3f7a78b"></a>mount（挂载）<br />
<div class="outline-text-5" id="text-2-7-2-5">
<p>
用法：mount [-t 文件系统] 设备名称 挂载点
<b>注意</b>
对于挂载windows目录，文件系统参数不能省略。挂载extn目录，文件系统参数可以省略。
</p>

<p>
<b>eg.</b>
mount -t vfat <i>dev/sdb1 /data
mount -o loop /xxx.iso</i> <i>mnt/xxx</i>   （挂在光盘镜像）
</p>
</div>
</li>
<li><a id="org957df2e"></a>umount（卸载）<br />
<div class="outline-text-5" id="text-2-7-2-6">
<p>
<b>用法</b>
umount /目录
</p>
</div>
</li>
<li><a id="org58b7598"></a>fdisk（磁盘分区）<br /></li>
<li><a id="orgd131042"></a>mkfs.*（格式化）<br />
<div class="outline-text-5" id="text-2-7-2-8">
<p>
*取决于格式化成什么系统，比如要格式化为ext3，就应该是mkfs.ext3
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org8f66246" class="outline-4">
<h4 id="org8f66246"><span class="section-number-4">2.7.3.</span> /etc/fstab文件 —— 决定分区的连接</h4>
<div class="outline-text-4" id="text-2-7-3">
<p>
让各个磁盘的各个分区具体挂载到哪个目录是由/etc/fstab文件所决定的，所以这个文件非常重要，一旦损坏或丢失，系统将无法正常启动。
</p>
</div>
<ol class="org-ol">
<li><a id="org197a401"></a>创建交换分区swap<br />
<div class="outline-text-5" id="text-2-7-3-1">
<ul class="org-ul">
<li>fdisk 创建交换分区</li>
<li>mkswap 格式化</li>
</ul>
</div>
</li>
<li><a id="orgef873ca"></a>挂载swap分区<br />
<div class="outline-text-5" id="text-2-7-3-2">
<ul class="org-ul">
<li>swapon 挂载swap</li>
<li>swapoff 卸载交换分区</li>
</ul>
</div>
</li>
<li><a id="org05c6097"></a>普通文件成为交换分区<br />
<div class="outline-text-5" id="text-2-7-3-3">
<p>
eg. 创建一个1G的交换文件：<br />
dd if=/dev/zero of=/tmp/swap bs=1M count=1024 <br />
(/dev/zero 是个空文件，这个dd命令的作用就是创建一个1G的空文件）
mkswap /tmp/swap<br />
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org636928d" class="outline-4">
<h4 id="org636928d"><span class="section-number-4">2.7.4.</span> 逻辑卷</h4>
<div class="outline-text-4" id="text-2-7-4">
</div>
<ol class="org-ol">
<li><a id="org886c4ee"></a>什么是逻辑卷<br />
<ol class="org-ol">
<li><a id="orge74c2c6"></a>更换分区目录（如更换home目录分区）<br />
<div class="outline-text-6" id="text-2-7-4-1-1">
<ul class="org-ul">
<li>划分更大的分区格式化为linux系统;</li>
<li>将原/home目录下的内容全部复制到新的分区;</li>
<li>修改/etc/fstab文件，让新的分区成为/home;</li>
</ul>
</div>
</li>
<li><a id="org34e1fb6"></a>逻辑卷的概念<br />
<div class="outline-text-6" id="text-2-7-4-1-2">
<p>
能够弹性的调整文件系统的容量。理论上说，逻辑卷就是在磁盘分区和文件系统之间增加了一个逻辑层，当文件系统容量不够用时，可以向逻辑卷中增加新的分区来实现扩大容量的目的;而当发现文件系统过大而有磁盘浪费的时候，可以选择去除一些基本没有使用的磁盘分区来达到减少容量的目的。
</p>

<p>
在linux系统中，实现逻辑卷功能的是LVM，Logical Volume Manager，逻辑卷管理器
</p>
</div>
</li>
</ol>
</li>
<li><a id="org00a0ef1"></a>基本属于和原理<br />
<ol class="org-ol">
<li><a id="orgf430976"></a>Physical Volume，PV，物理卷<br />
<div class="outline-text-6" id="text-2-7-4-2-1">
<p>
物理卷就是具体的磁盘分区，或者与磁盘分区有相同功能的设备，比如RAID。
</p>

<p>
PV是LVM的基本存储单元，与普通的磁盘分区相比，PV（物理卷）还要包含与LVM相关的管理参数
</p>
</div>
</li>
<li><a id="org55d5173"></a>Volume Group，VG，卷组<br />
<div class="outline-text-6" id="text-2-7-4-2-2">
<p>
卷组类似于非LVM系统中的物理磁盘，由多个物理卷组成，可以在卷组上创建一个或多个LVM分区
</p>
</div>
</li>
<li><a id="org02c725c"></a>Physical Extend，PE，物理扩展区<br />
<div class="outline-text-6" id="text-2-7-4-2-3">
<p>
每一个物理卷被进一步划分为被称为物理扩展区的基本单元，PE是LVM的最小存储区，与物理磁盘中的扇区或文件系统中的簇的概念基本相同。LVM的默认PE大小是4M，每个卷组最多仅能含有65534个PE。所以，一个卷组的最大容量就是4×65534=256G
</p>
</div>
</li>
<li><a id="orgcb95504"></a>Logical Volume，LV，逻辑卷<br />
<div class="outline-text-6" id="text-2-7-4-2-4">
<p>
逻辑卷就是在卷组的基础上再进行切分，与在物理磁盘上继续划分分区是一样的道理，逻辑卷的大小必须是PE的整数倍。
</p>

<p>
需要增加容量，就增加PE，需要减少容量，就减少PE。这就是LVM能够弹性的调整容量的秘密。
</p>
</div>
</li>
</ol>
</li>
<li><a id="orgd36e24b"></a>扩大和减小逻辑卷<br />
<div class="outline-text-5" id="text-2-7-4-3">
<p>
<b>后续在研究</b>
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orga5d1920" class="outline-3">
<h3 id="orga5d1920"><span class="section-number-3">2.8.</span> linux下的网络基础</h3>
<div class="outline-text-3" id="text-2-8">
</div>
<div id="outline-container-org0c7e463" class="outline-4">
<h4 id="org0c7e463"><span class="section-number-4">2.8.1.</span> 了解ip地址</h4>
<div class="outline-text-4" id="text-2-8-1">
<p>
（待记录……）
</p>
</div>
</div>
<div id="outline-container-org235d577" class="outline-4">
<h4 id="org235d577"><span class="section-number-4">2.8.2.</span> 相关配置文件</h4>
<div class="outline-text-4" id="text-2-8-2">
<p>
（
</p>
</div>
</div>
</div>
<div id="outline-container-org177c5d7" class="outline-3">
<h3 id="org177c5d7"><span class="section-number-3">2.9.</span> sh相关知识</h3>
<div class="outline-text-3" id="text-2-9">
<p>
shell是命令行解释和执行器，是介于使用者和unix/linux操作系统核心程序（kernel）之间的一个接口。
</p>
</div>
<div id="outline-container-orgf9f1e94" class="outline-4">
<h4 id="orgf9f1e94"><span class="section-number-4">2.9.1.</span> bash</h4>
<div class="outline-text-4" id="text-2-9-1">
<p>
bash（bourne again shell）是linux下的经典shell，对bourne shell 做了向下兼容，融入了许多C shell和Korn shell的功能
</p>
</div>
<ol class="org-ol">
<li><a id="orgc70531b"></a>bash的特点：<br />
<div class="outline-text-5" id="text-2-9-1-1">
<ul class="org-ul">
<li>别名功能（alias）。</li>
<li>历史命令（history），默认显示500个历史命令。</li>
<li>工作控制（job control）</li>
</ul>

<p>
下面个几个命令控制进程的进行：
</p>

<ul class="org-ul">
<li>ps —— 列出正在运行的进程</li>
<li>kill —— 向一个或多个进程发信号（杀掉进程）</li>
<li>jobs —— 列出自己运行的进程</li>
<li>bg —— 将进程放到后台</li>
<li>fg —— 将进程放到前台</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc252068" class="outline-4">
<h4 id="orgc252068"><span class="section-number-4">2.9.2.</span> 环境变量</h4>
<div class="outline-text-4" id="text-2-9-2">
<ul class="org-ul">
<li>登陆系统后，shell启动，并从启动它的/bin/login程序中继承了多个变量、I/O流和进程特征。如果遇到需要后台处、执行整组命令及脚本的情况，父shell会派生子shell应付这些工作，子shell从父shell那里继承环境。这个环境包括进程的权限、工作目录、文件创建掩码、特殊变量、打开的文件和信号。</li>

<li>变量包括局部变量和环境变量，局部变量无法传递给子shell，环境变量可以一直传递下去。</li>

<li>环境变量包括：PATH、HOME、LOGNAME、IFS和SHELL. 环境变量一般大写</li>

<li>环境变量的设定：set、env、export</li>

<li>环境变量的清除：unset</li>
</ul>
</div>
</div>
<div id="outline-container-org2dae6e5" class="outline-4">
<h4 id="org2dae6e5"><span class="section-number-4">2.9.3.</span> bash的配置文件</h4>
<div class="outline-text-4" id="text-2-9-3">
<ul class="org-ul">
<li>login shell：输入登陆用户名和密码后shell才启动。</li>

<li>non-longin-shell：不需要做重复的登陆操作获取bash界面。</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org0677238"></a>系统配置文件<br />
<div class="outline-text-5" id="text-2-9-3-1">
<p>
只有login shell才会读取系统配置文件/etc/profile，每个用户登陆bash后都会读取这个配置文件，如果想要设置的环境变量对所有的用户起作用，就要在这里设置
</p>
</div>
</li>
<li><a id="org8771b20"></a>用户个性配置文件<br />
<div class="outline-text-5" id="text-2-9-3-2">
<ul class="org-ul">
<li>login shell 读完了/etc/profile配置文件后，就会读取用户的个人配置文件，个人配置文件主要有三个home目录下的隐藏文件：
<ol class="org-ol">
<li>~/.bash<sub>profile</sub></li>
<li>~/.bash<sub>login</sub></li>
<li>~/.profile</li>
</ol></li>

<li>如果1存在，那么bash不会读取2、3，如果1不存在，bash会读取2，如果1和2都不存在，那么bash会读取3。</li>

<li>~/.bashrc ： 如果这个文件存在，那么~/bash<sub>profile还会调用它</sub>，哦哦们可以把一些环境设置写到该文件下。</li>

<li>~/.bash<sub>history和</sub>~/.bash<sub>logout</sub>
<ul class="org-ul">
<li>bash<sub>history</sub> 保存命立的历史记录，每次登陆bash后，bash会读取这个文件，将所有的历史命令读入内存。</li>
<li>bash<sub>logout</sub> 告诉系统在离开系统之前需要做的事情。默认情况下，文件只让bash清掉屏幕的信息。用户可以添加信息在这个文件中，例如备份等。</li>
</ul></li>
</ul>
</div>
</li>
<li><a id="orga77aee4"></a>non-login shell的设置<br />
<div class="outline-text-5" id="text-2-9-3-3">
<p>
详见p100
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-orga78c8b2" class="outline-3">
<h3 id="orga78c8b2"><span class="section-number-3">2.10.</span> 文本处理</h3>
<div class="outline-text-3" id="text-2-10">
</div>
<div id="outline-container-org422794b" class="outline-4">
<h4 id="org422794b"><span class="section-number-4">2.10.1.</span> 查看文本内容</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
查看文件的命令：
</p>
<ul class="org-ul">
<li>cat</li>
<li>more</li>
<li>less</li>
<li>head</li>
<li>tail：tail可以实现不停的读取和显示文件内容，可以用于查看日志起到实时监控的作用。</li>
</ul>
</div>
</div>
<div id="outline-container-orgea9d47c" class="outline-4">
<h4 id="orgea9d47c"><span class="section-number-4">2.10.2.</span> 正则表达式</h4>
<div class="outline-text-4" id="text-2-10-2">
</div>
<ol class="org-ol">
<li><a id="org7bf6281"></a>正则表达式的基本要素：<br />
<div class="outline-text-5" id="text-2-10-2-1">
<ul class="org-ul">
<li>表达式ε表示一个文本，包含一个长度为0的字符串，可以理解为{NULL}。通常将NULL记做ε。</li>
<li>表达式a表示仅有一个字符a的文本，即{a}</li>
</ul>
</div>
</li>
<li><a id="orgfef2c4e"></a>正则表达式的三种基本运算规则：<br />
<div class="outline-text-5" id="text-2-10-2-2">
<ul class="org-ul">
<li>并运算，记做X|Y，a|b={a，b}，相当于加法;</li>
<li>连接运算，记做XY，ab={ab}，X=a|b，Y=c|d，XY={ac，bc，ad，bd}，相当与乘法;</li>
<li>正则表达式的克林毕包，记做X* ,   表示将n个X与自己相连接，然后在就并，即X*=ε|X|XX|XXX|XXXX|……，a*={ε,  a,  aa,  aaa,  aaaa,  …………………}是一个无穷文本。</li>
</ul>
</div>
</li>
<li><a id="orgffb2c14"></a>运算的优先级<br />
<div class="outline-text-5" id="text-2-10-2-3">
<p>
克林毕包&gt;连接&gt;并
</p>
</div>
</li>
<li><a id="orgbb7d0fb"></a>正则表达式的扩展运算<br />
<div class="outline-text-5" id="text-2-10-2-4">
<ul class="org-ul">
<li>[] 表示括号内的字符做并运算，同时支持范围描述符号“-”。[abcd]=a|b|c|d=[a-d]</li>
<li>普通字符“-”在[]中的描述。应为在[]中支持范围描述符“-”，如果要在[]使用字符“-”，需要将它放在[]中的开头或最后，如[-abc]=-|a|b|c,  [abc-]=a|b|c|-;</li>
<li>[]中以<sup>开头</sup>，表示在字符集中排</li>
</ul>


<p>
除[]中的所有字符之后，所剩下字符的并运算，[<sup>ab</sup>]表示对除了ab以外的所有字符求并。
</p>
<ul class="org-ul">
<li>X？表示X|ε，代表X与空字符之间可选。</li>
<li>X+表示XX*，这表示X至少要重复一次，即至少等于X</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-org93e2eec" class="outline-4">
<h4 id="org93e2eec"><span class="section-number-4">2.10.3.</span> grep搜索文本</h4>
<div class="outline-text-4" id="text-2-10-3">
<p>
包含grep、egrep、fgrep。
</p>

<p>
egrep是grep的扩展支持跟多的正则表达式元字符
</p>

<p>
fgrep就是fixed grep或fast grep，只搜索字符，不使用正则表达式
</p>

<p>
gnu版的grep可以通过 -G、-E、-F命令选项来选择
</p>
</div>
<ol class="org-ol">
