note/linux就是这个范儿.org
**** grep支持的正则表达式
| 元字符   | 匹配对象                                                                                      |
|----------+-----------------------------------------------------------------------------------------------|
| ^        | 表示句首。如^abc表示以abc开头的句子                                                           |
| $        | 表示句尾。如abc$表示以abc结尾的句子                                                           |
| *        | 表示前一个字符0个或多个重复存在，如ab*c表示a和c之间有0个或多个b                               |
| []       | 匹配指定范围内的字符，如^[0-9]表示以数字开始的行                                              |
| [^]      | 匹配一个不在指定范围内的行，如[^（D-F）level]表示匹配不包含D-F的一个字符开头的并紧跟level的行 |
| （……） | 匹配一个不在指定范围内的字符。例子同上                                                        |
| \<       | 表示词首。如\<abc表示以abc开头的词                                                            |
| \>       | 表示词尾。如abc\>表示以abc结尾的词                                                            |
* 第三章 一棵“树”的奥秘
** linux的文件组织结构（p109 图3.1）
** 基本组织原则（p110）
** 根文件系统
*** 原则与特性
根文件系统保存在根分区，负责系统启动、修复、更新、恢复等重要任务
*** 必备内容
| 名称  | 功能                        |
|-------+-----------------------------|
| bin   | 重要的可执行文件，shell命令 |
| boot  | 引导器配置文件、内核        |
| dev   | 设备文件                    |
| etc   | 系统专有配置文件            |
| lib   | 重要的共享库和内核模块      |
| media | 可移动设备挂载点            |
| mnt   | 其它文件的临时挂载点        |
| opt   | 附加应用软件包              |
| sbin  | 重要的必须的系统可执行文件     |
| srv   | 本系统提供的用于服务器的数据 |
| tmp   | 临时文件                     |
| usr   | 文件系统的第二层             |
| var   | 可变数据                         |
** 子目录
*** /etc目录
 包含系统特有的配置文件
**** 需要放在/etc目录下的文件
| 名称 | 功能               |
|------+--------------------|
| opt  | 各软件的配置文件   |
| rc.d | init进程的配置文件 |
| X11  | X window系统的配置文件，可选 |
| sgml | sgml的配置文件，可选         |
| xml  | xml的配置文件，可选                  |

- X11目录下的文件：\\
  - xorg.conf —— Xorg的配置文件（最常见）
  - Xmodmap —— 定义xdm和xinit所使用的键盘映射
  - xconfig —— 早期的XFree86的配置文件（现在已经被xorg取代）
*** /sbin目录——必备的系统软件
用于系统维护的软件和某些只限root用户使用的命令存储在/sbin、/usr/sbin和/usr/local/sbin目录下。
- /sbin目录存储的是那些在系统启动、恢复、欢迎以及修复过程中必备的系统工具，是对/bin系统下的补充。
- /usr/sbin目录存储的是在/usr目录被挂载后才需要的程序。
* 第四章 笨出来的文化和哲学
** 万般皆文本
- linux中除了可以执行的文件，其他的一切几乎都是文本，如存储用户名和密码的passwd文件、存储图片的xmp文件等。
- xmp：linux下最常见的图片格式之一，最初是为X windows而设计的，是由c语言的语法构成的纯文本文件，可以直接包含在c语言程序中。
*** 配置文件的DSV风格
所有的配置文件都有一个统一的风格——DSV
- DSV：Delimiter-Separated Values的缩写，翻译过来是“分隔符分隔值”，含义是使用“分隔符”将一个一个的“值”分割开来，便于取值处理。“值”也可以理解为“字段”
** linux中的配置文件
*** 配置三元素
- 配置文件
- 环境变量
- 命令行选项
**** 详细的划分（系统级别和用户级别的区分）
- 系统配置文件、系统环境变量
- 用户配置文件、用户环境变量
- 命令行选项
**** 三者的顺序
系统级别的优先级最高，命令选项优先级最低
**** 三者的响应顺序
命令行 > 用户级别 > 系统级别
**** 选择配置机制的原则
- 调用时可能发生变化的配置信息 —— 使用命令行选项;
- 改动很少但确实应该由各个用户控制的配置信息 —— 使用用户配置文件或用户环境变量;
- 需要由系统管理员设置而不需要用户改变的整体系统级选项数据 ——系统级配置文件或系统级环境变量;
*** 配置文件
- 配置文件的含义：学名是“运行控制文件”，存放与具体程序相关的声明信息，有时甚至是可执行文件，在程序启动时解析
- 配置文件的位置：
  - 系统级别的配置文件，放置在/etc下。
  - 用户界别的配置文件，放置在home目录下，并且一般都是隐藏文件（以 . 开头），一般称为点文件。
  - 配置文件的命名方式：命名方式没有严格规定，基本与程序名称一致。
  - 古老的命名约定：可执行文件名后加“rc”后缀（rc代表运行控制），如/etc/bashrc和.bashrc，前者是bash的系统配置文件，后者是bash的用户配置文件
*** 环境变量 
当linux程序启动时，它的运行环境会包含一组名字和值（名字和值都是字符串），有些是由用户手工设置的，有些是由系统在登陆时设置的，有些是由shell或虚拟终端设置的，这就是环境变量。linux下，环境变量一般会携带文件搜索路径、系统默认值、当前用户ID和进程ID等信息。
**** 常见的系统环境变量
| 变量名  | 用途                                                                                                |
|---------+-----------------------------------------------------------------------------------------------------|
| USER    | 当前会话登陆的帐户名（BSD约定）                                                                     |
| LOGNAME | 当前会话登陆的帐户名（System V约定                                                                  |
| HOME    | 当前会话的用户home目录                                                                              |
| COLUMNS | 文本控制台或虚拟窗口以字符为单位的列数，通过这个环境变量，CLI的程序可以了解一行内最多能输出多少字符 |
| LINES   | 文本控制台或虚拟终端窗口以字符为单位的行数，通过这个环境变量，CLI的程序可以了解屏幕上最多可以显示多少行文本 |
| SHELL   | 当前使用的shell的名字                                                                                       |
| PATH    | shell搜索可执行程序的目录列表                                                                               |
| TERM    | 当前会话控制台或虚拟终端的名称。最大的用途就是程序能够知道可以使用哪些特性，比如是否可以输出中文等。                                                          |
* 第五章 shell脚本编程
** 第一个shell脚本程序
*** 程序代码
#+BEGIN_QUOTE
#！/bin/sh
# My first script
echo “Hello World！
#+END_QUOTE

*** 注解：
- #开头的是注释
- #!第一行是脚本解释程序的声明指令，由调用这个脚本的shell来检测，仅在脚本第一行才有效。
- 要使脚本能够执行，需要使用chmod命令赋予可执行权限，比如 ： chmod 755 ……
*** 变量
- 变量的命名规则
  - 首个字符必须为字母
  - 中间不能有空格，可以使用下划线
  - 不能使用标点符号
  - 不能使用bash里的关键字（可以使用help命令查看保留关键字）
- 变量的调用
   使用$直接调用变量
*** 运算
