note/linux就是这个范儿.html
<li><a id="org27577ac"></a>grep支持的正则表达式<br />
<div class="outline-text-5" id="text-2-10-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">元字符</th>
<th scope="col" class="org-left">匹配对象</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">^</td>
<td class="org-left">表示句首。如<sup>abc表示以abc开头的句子</sup></td>
</tr>

<tr>
<td class="org-left">$</td>
<td class="org-left">表示句尾。如abc$表示以abc结尾的句子</td>
</tr>

<tr>
<td class="org-left">*</td>
<td class="org-left">表示前一个字符0个或多个重复存在，如ab*c表示a和c之间有0个或多个b</td>
</tr>

<tr>
<td class="org-left">[]</td>
<td class="org-left">匹配指定范围内的字符，如^[0-9]表示以数字开始的行</td>
</tr>

<tr>
<td class="org-left">[^]</td>
<td class="org-left">匹配一个不在指定范围内的行，如[^（D-F）level]表示匹配不包含D-F的一个字符开头的并紧跟level的行</td>
</tr>

<tr>
<td class="org-left">（……）</td>
<td class="org-left">匹配一个不在指定范围内的字符。例子同上</td>
</tr>

<tr>
<td class="org-left">\&lt;</td>
<td class="org-left">表示词首。如\&lt;abc表示以abc开头的词</td>
</tr>

<tr>
<td class="org-left">\&gt;</td>
<td class="org-left">表示词尾。如abc\&gt;表示以abc结尾的词</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4096462" class="outline-2">
<h2 id="org4096462"><span class="section-number-2">3.</span> 第三章 一棵“树”的奥秘</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org54e71d2" class="outline-3">
<h3 id="org54e71d2"><span class="section-number-3">3.1.</span> linux的文件组织结构（p109 图3.1）</h3>
</div>
<div id="outline-container-orge75c334" class="outline-3">
<h3 id="orge75c334"><span class="section-number-3">3.2.</span> 基本组织原则（p110）</h3>
</div>
<div id="outline-container-org9b70d13" class="outline-3">
<h3 id="org9b70d13"><span class="section-number-3">3.3.</span> 根文件系统</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-orgbf57334" class="outline-4">
<h4 id="orgbf57334"><span class="section-number-4">3.3.1.</span> 原则与特性</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
根文件系统保存在根分区，负责系统启动、修复、更新、恢复等重要任务
</p>
</div>
</div>
<div id="outline-container-org1a30de2" class="outline-4">
<h4 id="org1a30de2"><span class="section-number-4">3.3.2.</span> 必备内容</h4>
<div class="outline-text-4" id="text-3-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">bin</td>
<td class="org-left">重要的可执行文件，shell命令</td>
</tr>

<tr>
<td class="org-left">boot</td>
<td class="org-left">引导器配置文件、内核</td>
</tr>

<tr>
<td class="org-left">dev</td>
<td class="org-left">设备文件</td>
</tr>

<tr>
<td class="org-left">etc</td>
<td class="org-left">系统专有配置文件</td>
</tr>

<tr>
<td class="org-left">lib</td>
<td class="org-left">重要的共享库和内核模块</td>
</tr>

<tr>
<td class="org-left">media</td>
<td class="org-left">可移动设备挂载点</td>
</tr>

<tr>
<td class="org-left">mnt</td>
<td class="org-left">其它文件的临时挂载点</td>
</tr>

<tr>
<td class="org-left">opt</td>
<td class="org-left">附加应用软件包</td>
</tr>

<tr>
<td class="org-left">sbin</td>
<td class="org-left">重要的必须的系统可执行文件</td>
</tr>

<tr>
<td class="org-left">srv</td>
<td class="org-left">本系统提供的用于服务器的数据</td>
</tr>

<tr>
<td class="org-left">tmp</td>
<td class="org-left">临时文件</td>
</tr>

<tr>
<td class="org-left">usr</td>
<td class="org-left">文件系统的第二层</td>
</tr>

<tr>
<td class="org-left">var</td>
<td class="org-left">可变数据</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-orgbb17a9f" class="outline-3">
<h3 id="orgbb17a9f"><span class="section-number-3">3.4.</span> 子目录</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-org14996b7" class="outline-4">
<h4 id="org14996b7"><span class="section-number-4">3.4.1.</span> /etc目录</h4>
<div class="outline-text-4" id="text-3-4-1">
<p>
包含系统特有的配置文件
</p>
</div>
<ol class="org-ol">
<li><a id="org680ad3b"></a>需要放在/etc目录下的文件<br />
<div class="outline-text-5" id="text-3-4-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">名称</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">opt</td>
<td class="org-left">各软件的配置文件</td>
</tr>

<tr>
<td class="org-left">rc.d</td>
<td class="org-left">init进程的配置文件</td>
</tr>

<tr>
<td class="org-left">X11</td>
<td class="org-left">X window系统的配置文件，可选</td>
</tr>

<tr>
<td class="org-left">sgml</td>
<td class="org-left">sgml的配置文件，可选</td>
</tr>

<tr>
<td class="org-left">xml</td>
<td class="org-left">xml的配置文件，可选</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>X11目录下的文件：<br />
<ul class="org-ul">
<li>xorg.conf —— Xorg的配置文件（最常见）</li>
<li>Xmodmap —— 定义xdm和xinit所使用的键盘映射</li>
<li>xconfig —— 早期的XFree86的配置文件（现在已经被xorg取代）</li>
</ul></li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc091672" class="outline-4">
<h4 id="orgc091672"><span class="section-number-4">3.4.2.</span> /sbin目录——必备的系统软件</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
用于系统维护的软件和某些只限root用户使用的命令存储在/sbin、/usr/sbin和/usr/local/sbin目录下。
</p>
<ul class="org-ul">
<li>/sbin目录存储的是那些在系统启动、恢复、欢迎以及修复过程中必备的系统工具，是对/bin系统下的补充。</li>
<li>/usr/sbin目录存储的是在/usr目录被挂载后才需要的程序。</li>
</ul>
</div>
</div>
</div>
</div>
<div id="outline-container-org42af428" class="outline-2">
<h2 id="org42af428"><span class="section-number-2">4.</span> 第四章 笨出来的文化和哲学</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9431a1f" class="outline-3">
<h3 id="org9431a1f"><span class="section-number-3">4.1.</span> 万般皆文本</h3>
<div class="outline-text-3" id="text-4-1">
<ul class="org-ul">
<li>linux中除了可以执行的文件，其他的一切几乎都是文本，如存储用户名和密码的passwd文件、存储图片的xmp文件等。</li>
<li>xmp：linux下最常见的图片格式之一，最初是为X windows而设计的，是由c语言的语法构成的纯文本文件，可以直接包含在c语言程序中。</li>
</ul>
</div>
<div id="outline-container-orgd67d298" class="outline-4">
<h4 id="orgd67d298"><span class="section-number-4">4.1.1.</span> 配置文件的DSV风格</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
所有的配置文件都有一个统一的风格——DSV
</p>
<ul class="org-ul">
<li>DSV：Delimiter-Separated Values的缩写，翻译过来是“分隔符分隔值”，含义是使用“分隔符”将一个一个的“值”分割开来，便于取值处理。“值”也可以理解为“字段”</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgd31caf5" class="outline-3">
<h3 id="orgd31caf5"><span class="section-number-3">4.2.</span> linux中的配置文件</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org5963dea" class="outline-4">
<h4 id="org5963dea"><span class="section-number-4">4.2.1.</span> 配置三元素</h4>
<div class="outline-text-4" id="text-4-2-1">
<ul class="org-ul">
<li>配置文件</li>
<li>环境变量</li>
<li>命令行选项</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org30f1c3f"></a>详细的划分（系统级别和用户级别的区分）<br />
<div class="outline-text-5" id="text-4-2-1-1">
<ul class="org-ul">
<li>系统配置文件、系统环境变量</li>
<li>用户配置文件、用户环境变量</li>
<li>命令行选项</li>
</ul>
</div>
</li>
<li><a id="org4db395f"></a>三者的顺序<br />
<div class="outline-text-5" id="text-4-2-1-2">
<p>
系统级别的优先级最高，命令选项优先级最低
</p>
</div>
</li>
<li><a id="orge885016"></a>三者的响应顺序<br />
<div class="outline-text-5" id="text-4-2-1-3">
<p>
命令行 &gt; 用户级别 &gt; 系统级别
</p>
</div>
</li>
<li><a id="org0dbd536"></a>选择配置机制的原则<br />
<div class="outline-text-5" id="text-4-2-1-4">
<ul class="org-ul">
<li>调用时可能发生变化的配置信息 —— 使用命令行选项;</li>
<li>改动很少但确实应该由各个用户控制的配置信息 —— 使用用户配置文件或用户环境变量;</li>
<li>需要由系统管理员设置而不需要用户改变的整体系统级选项数据 ——系统级配置文件或系统级环境变量;</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orgc4ba8c8" class="outline-4">
<h4 id="orgc4ba8c8"><span class="section-number-4">4.2.2.</span> 配置文件</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li>配置文件的含义：学名是“运行控制文件”，存放与具体程序相关的声明信息，有时甚至是可执行文件，在程序启动时解析</li>
<li>配置文件的位置：
<ul class="org-ul">
<li>系统级别的配置文件，放置在/etc下。</li>
<li>用户界别的配置文件，放置在home目录下，并且一般都是隐藏文件（以 . 开头），一般称为点文件。</li>
<li>配置文件的命名方式：命名方式没有严格规定，基本与程序名称一致。</li>
<li>古老的命名约定：可执行文件名后加“rc”后缀（rc代表运行控制），如/etc/bashrc和.bashrc，前者是bash的系统配置文件，后者是bash的用户配置文件</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgce63d9c" class="outline-4">
<h4 id="orgce63d9c"><span class="section-number-4">4.2.3.</span> 环境变量</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
当linux程序启动时，它的运行环境会包含一组名字和值（名字和值都是字符串），有些是由用户手工设置的，有些是由系统在登陆时设置的，有些是由shell或虚拟终端设置的，这就是环境变量。linux下，环境变量一般会携带文件搜索路径、系统默认值、当前用户ID和进程ID等信息。
</p>
</div>
<ol class="org-ol">
<li><a id="org6beef16"></a>常见的系统环境变量<br />
<div class="outline-text-5" id="text-4-2-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">变量名</th>
<th scope="col" class="org-left">用途</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">USER</td>
<td class="org-left">当前会话登陆的帐户名（BSD约定）</td>
</tr>

<tr>
<td class="org-left">LOGNAME</td>
<td class="org-left">当前会话登陆的帐户名（System V约定</td>
</tr>

<tr>
<td class="org-left">HOME</td>
<td class="org-left">当前会话的用户home目录</td>
</tr>

<tr>
<td class="org-left">COLUMNS</td>
<td class="org-left">文本控制台或虚拟窗口以字符为单位的列数，通过这个环境变量，CLI的程序可以了解一行内最多能输出多少字符</td>
</tr>

<tr>
<td class="org-left">LINES</td>
<td class="org-left">文本控制台或虚拟终端窗口以字符为单位的行数，通过这个环境变量，CLI的程序可以了解屏幕上最多可以显示多少行文本</td>
</tr>

<tr>
<td class="org-left">SHELL</td>
<td class="org-left">当前使用的shell的名字</td>
</tr>

<tr>
<td class="org-left">PATH</td>
<td class="org-left">shell搜索可执行程序的目录列表</td>
</tr>

<tr>
<td class="org-left">TERM</td>
<td class="org-left">当前会话控制台或虚拟终端的名称。最大的用途就是程序能够知道可以使用哪些特性，比如是否可以输出中文等。</td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org4818152" class="outline-2">
<h2 id="org4818152"><span class="section-number-2">5.</span> 第五章 shell脚本编程</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgfd05c4f" class="outline-3">
<h3 id="orgfd05c4f"><span class="section-number-3">5.1.</span> 第一个shell脚本程序</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-orgbaa9100" class="outline-4">
<h4 id="orgbaa9100"><span class="section-number-4">5.1.1.</span> 程序代码</h4>
<div class="outline-text-4" id="text-5-1-1">
<blockquote>
<p>
#！/bin/sh
</p>

<p>
echo “Hello World！
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org04dc9a1" class="outline-4">
<h4 id="org04dc9a1"><span class="section-number-4">5.1.2.</span> 注解：</h4>
<div class="outline-text-4" id="text-5-1-2">
<ul class="org-ul">
<li>#开头的是注释</li>
<li>#!第一行是脚本解释程序的声明指令，由调用这个脚本的shell来检测，仅在脚本第一行才有效。</li>
<li>要使脚本能够执行，需要使用chmod命令赋予可执行权限，比如 ： chmod 755 ……</li>
</ul>
</div>
</div>
<div id="outline-container-orgb3ea792" class="outline-4">
<h4 id="orgb3ea792"><span class="section-number-4">5.1.3.</span> 变量</h4>
<div class="outline-text-4" id="text-5-1-3">
<ul class="org-ul">
<li>变量的命名规则
<ul class="org-ul">
<li>首个字符必须为字母</li>
<li>中间不能有空格，可以使用下划线</li>
<li>不能使用标点符号</li>
<li>不能使用bash里的关键字（可以使用help命令查看保留关键字）</li>
</ul></li>
<li>变量的调用
使用$直接调用变量</li>
</ul>
</div>
</div>
