note/linux就是这个范儿.org
**** expr用于整数值运算，每一项用空格隔开
#+BEGIN_QUOTE
weight=`expr $weight + 1`
#+END_QUOTE
一个注意事项：*在shell中 有特殊意义，应该写成“\*”，或者用双括号“”括起来。
**** let表示数学运算
#+BEGIN_QUOTE
let "weight+=1"
let "weight = weight+1"
#+END_QUOTE
**** (())方法和let一样
#+BEGIN_QUOTE
((weight+=1))
#+END_QUOTE
**** $[] 将中括号中的表达式作为数学运算先计算结果再输出
** 脚本的基本要素
*** 变量
- shell中变量无需事先声明;
- 看到以$开头的单词，会寻找变量的值，然后代替
**** 变量的命名规则
- 首个字符必须为字母
- 中间不能有空格，可以使用（_）
- 不能使用标点符号
- 不能使用basn里的关键词
**** 引号（“”）内的变量
- 引号内的变量 加上$后，仍然是取值
**** 用{}明确变量名
如 ${sum}apples
*** 运算
#+BEGIN_QUOTE
脚本仅仅提供了整数的数学运算\\
weight=1
weight=weitht+1
echo $weitht

得到的结果不是2,  而是1+1， 直接相加相当于是字符的连接
#+END_QUOTE
**** 数学运算的表达式
- expr：用于整数值运算，每一项用空格隔开
#+BEGIN_QUOTE
weigt='exper $weight + 1'
#+END_QUOTE

- let：表示数学运算
#+BEGIN_QUOTE
let "weight+=1" 或 let "weight=$weight+1"
#+END_QUOTE

- (()) ：用法和let类似
#+BEGIN_QUOTE
((weight+=1)) 或 ((weight=$weight+1))
#+END_QUOTE

- $[ ]：将中括号内的表达式作为数学运算先计算结果再输出

- 乘法 * 运算的表达
因为 * 在shell中有特殊意义，用\*表示乘法.
*** 流程控制
**** if语句
1. 第一种
#+BEGIN_QUOTE
if condition ; then
    commands
fi
#+END_QUOTE

2. 第二种
#+BEGIN_QUOTE
if condition ; then
    commands
fi
#+END_QUOTE

3. 第三种
#+BEGIN_QUOTE
if condition1 ; then
    command1
elif condition2 ; then
    command2
fi
#+END_QUOTE
**** test语句
test语句返回的是exit状态（即true和false），经常和if语句一起使用，作为if的条件
***** test的两种形式
1. 第一种形式
test expression
2. 第二种形式（这种形式经常配合if语句）
[  expression  ]
*方括号和expressio之间必须有空格*
***** 实际例子
#+BEGIN_QUOTE
……
if [  -z "$1"  ] ; then
    ……
fi
#+END_QUOTE

**** exit语句
- exit 0 —— 退出脚本，状态值为0（成功）
- exit 1 —— 退出脚本，状态值为1（失败）
**** case语句
case表达式用来匹配一个给定的字符串，而不是数字
* 第七章 编辑器
** vi
暂时未做笔记
** emacs
*** emacs的来历
emacs是由 Richard Stallman于1975年在MIT人工智能实验室与 Guy Lewis Steele Jr 共同开发出来的。（p274）
*** buffer、window、frame
**** buffer
文件在内存中的表示，Emacs并不直接对文件进行操作，而是把文件加载到Buffer中供用户操作。只有当用于确定要把在Buffer中所做的修改写入文件时，即执行“save-buffer”命令时，Emacs才把Buffer中的内容写入文件。
**** window
Buffer的显示区域，或者说是view。
**** Frame
Emacs的实际窗口。一个Frame中可以包含多个Window，每个Window显示一个Buffer的内容。
