note/linux就是这个范儿.html
<div id="outline-container-org1e77214" class="outline-4">
<h4 id="org1e77214"><span class="section-number-4">5.1.4.</span> 运算</h4>
<div class="outline-text-4" id="text-5-1-4">
</div>
<ol class="org-ol">
<li><a id="orgfef7c31"></a>expr用于整数值运算，每一项用空格隔开<br />
<div class="outline-text-5" id="text-5-1-4-1">
<blockquote>
<p>
weight=`expr $weight + 1`
</p>
</blockquote>
<p>
一个注意事项：*在shell中 有特殊意义，应该写成“\*”，或者用双括号“”括起来。
</p>
</div>
</li>
<li><a id="orgbbcce13"></a>let表示数学运算<br />
<div class="outline-text-5" id="text-5-1-4-2">
<blockquote>
<p>
let "weight+=1"
let "weight = weight+1"
</p>
</blockquote>
</div>
</li>
<li><a id="org3a6904f"></a>(())方法和let一样<br />
<div class="outline-text-5" id="text-5-1-4-3">
<blockquote>
<p>
((weight+=1))
</p>
</blockquote>
</div>
</li>
<li><a id="orgd869640"></a>$[] 将中括号中的表达式作为数学运算先计算结果再输出<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org2c53f30" class="outline-3">
<h3 id="org2c53f30"><span class="section-number-3">5.2.</span> 脚本的基本要素</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-org6144290" class="outline-4">
<h4 id="org6144290"><span class="section-number-4">5.2.1.</span> 变量</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>shell中变量无需事先声明;</li>
<li>看到以$开头的单词，会寻找变量的值，然后代替</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org94c296f"></a>变量的命名规则<br />
<div class="outline-text-5" id="text-5-2-1-1">
<ul class="org-ul">
<li>首个字符必须为字母</li>
<li>中间不能有空格，可以使用（_）</li>
<li>不能使用标点符号</li>
<li>不能使用basn里的关键词</li>
</ul>
</div>
</li>
<li><a id="org4a5dd4c"></a>引号（“”）内的变量<br />
<div class="outline-text-5" id="text-5-2-1-2">
<ul class="org-ul">
<li>引号内的变量 加上$后，仍然是取值</li>
</ul>
</div>
</li>
<li><a id="orge4951bb"></a>用{}明确变量名<br />
<div class="outline-text-5" id="text-5-2-1-3">
<p>
如 ${sum}apples
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org09d134b" class="outline-4">
<h4 id="org09d134b"><span class="section-number-4">5.2.2.</span> 运算</h4>
<div class="outline-text-4" id="text-5-2-2">
<blockquote>
<p>
脚本仅仅提供了整数的数学运算<br />
weight=1
weight=weitht+1
echo $weitht
</p>

<p>
得到的结果不是2,  而是1+1， 直接相加相当于是字符的连接
</p>
</blockquote>
</div>
<ol class="org-ol">
<li><a id="orgbff0a32"></a>数学运算的表达式<br />
<div class="outline-text-5" id="text-5-2-2-1">
<ul class="org-ul">
<li>expr：用于整数值运算，每一项用空格隔开</li>
</ul>
<blockquote>
<p>
weigt='exper $weight + 1'
</p>
</blockquote>

<ul class="org-ul">
<li>let：表示数学运算</li>
</ul>
<blockquote>
<p>
let "weight+=1" 或 let "weight=$weight+1"
</p>
</blockquote>

<ul class="org-ul">
<li>(()) ：用法和let类似</li>
</ul>
<blockquote>
<p>
((weight+=1)) 或 ((weight=$weight+1))
</p>
</blockquote>

<ul class="org-ul">
<li>$[ ]：将中括号内的表达式作为数学运算先计算结果再输出</li>

<li>乘法 * 运算的表达</li>
</ul>
<p>
因为 * 在shell中有特殊意义，用\*表示乘法.
</p>
</div>
</li>
</ol>
</div>
<div id="outline-container-org4ea1a9d" class="outline-4">
<h4 id="org4ea1a9d"><span class="section-number-4">5.2.3.</span> 流程控制</h4>
<div class="outline-text-4" id="text-5-2-3">
</div>
<ol class="org-ol">
<li><a id="org76fcf67"></a>if语句<br />
<div class="outline-text-5" id="text-5-2-3-1">
<ol class="org-ol">
<li>第一种</li>
</ol>
<blockquote>
<p>
if condition ; then
    commands
fi
</p>
</blockquote>

<ol class="org-ol">
<li>第二种</li>
</ol>
<blockquote>
<p>
if condition ; then
    commands
fi
</p>
</blockquote>

<ol class="org-ol">
<li>第三种</li>
</ol>
<blockquote>
<p>
if condition1 ; then
    command1
elif condition2 ; then
    command2
fi
</p>
</blockquote>
</div>
</li>
<li><a id="org1419245"></a>test语句<br />
<div class="outline-text-5" id="text-5-2-3-2">
<p>
test语句返回的是exit状态（即true和false），经常和if语句一起使用，作为if的条件
</p>
</div>
<ol class="org-ol">
<li><a id="orgf1f2410"></a>test的两种形式<br />
<div class="outline-text-6" id="text-5-2-3-2-1">
<ol class="org-ol">
<li>第一种形式</li>
</ol>
<p>
test expression
</p>
<ol class="org-ol">
<li>第二种形式（这种形式经常配合if语句）</li>
</ol>
<p>
[  expression  ]
<b>方括号和expressio之间必须有空格</b>
</p>
</div>
</li>
<li><a id="org7b9454e"></a>实际例子<br />
<div class="outline-text-6" id="text-5-2-3-2-2">
<blockquote>
<p>
……
if [  -z "$1"  ] ; then
    ……
fi
</p>
</blockquote>
</div>
</li>
</ol>
</li>
<li><a id="org455b5c4"></a>exit语句<br />
<div class="outline-text-5" id="text-5-2-3-3">
<ul class="org-ul">
<li>exit 0 —— 退出脚本，状态值为0（成功）</li>
<li>exit 1 —— 退出脚本，状态值为1（失败）</li>
</ul>
</div>
</li>
<li><a id="org975fddc"></a>case语句<br />
<div class="outline-text-5" id="text-5-2-3-4">
<p>
case表达式用来匹配一个给定的字符串，而不是数字
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-org313f498" class="outline-2">
<h2 id="org313f498"><span class="section-number-2">6.</span> 第七章 编辑器</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org3c956c9" class="outline-3">
<h3 id="org3c956c9"><span class="section-number-3">6.1.</span> vi</h3>
<div class="outline-text-3" id="text-6-1">
<p>
暂时未做笔记
</p>
</div>
</div>
<div id="outline-container-org5290fd7" class="outline-3">
<h3 id="org5290fd7"><span class="section-number-3">6.2.</span> emacs</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org2b540ef" class="outline-4">
<h4 id="org2b540ef"><span class="section-number-4">6.2.1.</span> emacs的来历</h4>
<div class="outline-text-4" id="text-6-2-1">
<p>
emacs是由 Richard Stallman于1975年在MIT人工智能实验室与 Guy Lewis Steele Jr 共同开发出来的。（p274）
</p>
</div>
</div>
<div id="outline-container-orge1bbcf0" class="outline-4">
<h4 id="orge1bbcf0"><span class="section-number-4">6.2.2.</span> buffer、window、frame</h4>
<div class="outline-text-4" id="text-6-2-2">
</div>
<ol class="org-ol">
<li><a id="org9a4cf24"></a>buffer<br />
<div class="outline-text-5" id="text-6-2-2-1">
<p>
文件在内存中的表示，Emacs并不直接对文件进行操作，而是把文件加载到Buffer中供用户操作。只有当用于确定要把在Buffer中所做的修改写入文件时，即执行“save-buffer”命令时，Emacs才把Buffer中的内容写入文件。
</p>
</div>
</li>
<li><a id="org3332be4"></a>window<br />
<div class="outline-text-5" id="text-6-2-2-2">
<p>
Buffer的显示区域，或者说是view。
</p>
</div>
</li>
<li><a id="org2cddbc5"></a>Frame<br />
<div class="outline-text-5" id="text-6-2-2-3">
<p>
Emacs的实际窗口。一个Frame中可以包含多个Window，每个Window显示一个Buffer的内容。
</p>
</div>
</li>
</ol>
</div>
