note/linux就是这个范儿.org
*** emscs的基本使用
*emacs 常用的快捷键*
| 命令                       | 快捷键     | 功能                                       |
|----------------------------+------------+--------------------------------------------|
| move-beginning-of-line     | c-a        | 光标移动到行首                             |
| move-end-of-line           | c-e        | 光标移动到行尾                             |
| forward-char               | c-f        | 光标右移一个字符                           |
| backward-char              | c-b        | 光标左移一个字符                           |
| next-line                  | c-n        | 光标下移一行                               |
| previous-line              | c-p        | 光标上移一行                               |
| forward-word               | m-f        | 光标右移一个单词                           |
| backward-word              | m-b        | 光标左移一个单词                           |
| beginning-of-buffer        | m-<        | 光标移动到文件开头                         |
| end-of-buffer              | m-<        | 光标移动到文件末尾                         |
| scroll-up                  | c-v        | 光标移动到下一页                           |
| scroll-down                | m-v        | 光标移动到上一页                           |
| set-mark-command           | c-space    | 开启标记模式，切换到选中状态               |
| mark-whole-buffer          | c-x h      | 文档全选                                   |
| kill-region                | c-w        | cut 剪切操作                               |
| kill-ring-save             | m-w        | copy 复制操作                              |
| kill-line                  | c-k        | 删除光标到行尾的所有内容                   |
| delete-char                | c-d        | 删除光标所在字符                           |
| delete-backward-char       | 退格键     | 删除光标前的字符                           |
| yank                       | c-y        | past 粘帖操作                              |
| yank-pop                   | m-y        | 粘帖剪切板中的上个内容，循环剪切板中的内容 |
| undo                       | c-x u或c-_ | 撤销                                       |
| isearch-forward            | c-s        | 向下搜索                                   |
| isearch-backward           | c-r        | 向上搜索                                   |
| save-buffer                | c-x c-s    | 保存                                       |
| write-file                 | c-x c-w    | 另存                                       |
| save-buffers-kill-terminal | c-x c-c    | 保存并退出                                 |
| switch-to-buffer           | c-x b      | 切换已经打开的文件                         |
| kill-buffer                | c-x k      | 关闭已经打开的文件                                  | 

*emacs获取帮助命令的快捷键*
| 命令              | 快捷键 | 功能                           |
|-------------------+--------+--------------------------------|
| describe-variable | c-h v  | 查看某个内置Lisp变量的说明文档 |
| describe-function | c-h f  | 查看某个内置命令的说明文档     |
| describe-mode     | c-h m  | 查看当前buffer对应的mode的说明文档 |
| describe-key      | c-h k  | 查看某个快捷键对应的命令           |
| where-is          | c-h w  | 查看某个命令绑定的快捷键           |
| describe-bindings | c-h b  | 查看当前buffer所有的快捷键列表     |
| find-function     | 无     | 查看某个内置命令的Lisp源代码       |
| find-variable     | 无     | 查看某个内置变量的Lisp源代码       |
| Apropos           | 无     | 模糊查询内置命令或变量的说明文档                   |
*** Lisp语言
- Lisp是世界上第一个函数性编程语言
- Lisp只有两种基本的数据
- Lisp只有唯一的一种基本语法结构——表达式
**** Lisp的原子和表
- Lisp的表达式是由一个原子（atom）或表（list）构成。
- 原子（atom）由符号（symbol）和数值（number）构成。
- 表是由零个或多个表达式组成的串行，表达式之间用空格分开，放入一对括号中
- 原子和表：
abc ; 原子\\
（）   ;  空表\\
（abc xyz）; 包含两个原子的表\\
（a b （c）d）; 包含四个原子的表，其中第三个原子本身也是表，这种表称为嵌套表。
**** Lisp中的表达式
如果表达式是一个表，把表中的第一个元素叫做操作符，其余的元素叫做自变量。在lisp中，1+1的表达式的写法是：\\
          (+ 1 1)
* 第九章 特种文件系统
** 日志和ReiserFS
*** 理解日志
1. 元数据
元数据就是诠释数据的数据。  作为文件系统，一定要提供存储、查询和处理数据的功能。  文件系统内部就保存了一个内部数据结构，使得这些操作成为可能，这个内部数据结构就是元数据，他为文件系统提供特定的身份和性能特征。

元数据对于大部分人来说是不必关心的，因为元数据是专门交给文件系统的驱动程序使用的。  想要文件系统的驱动程序好好干活，它就得轻松愉快的找到元数据。  有三个要求：
- 合理
- 一致
- 无干扰

做不到这三点的话，驱动程序就无法理解元数据，也操作不了，那么，就只能跟文件系统说拜拜了。  

文件系统是文件系统，文件系统的驱动程序是文件系统的驱动程序，不是一码事

2. fsck
fsck确保文件系统驱动程序要用的元数据是干净的

每次linux启动，在没有挂接任何文件系统的时候都会启动fsck扫描/etc/fstab 文件中列出的本地文件系统；  每次linux关闭，它要把还在内存中的被称之为页面缓存中的数据传送到磁盘，还要保证把已经挂接的文件系统卸载干净。

3. fsck的问题
当linux遇到异常关机，重启后，fsck就会发现文件系统没有卸载赶紧，对应的元数据可能不干净，已经出了问题，于是fsck开始全面审查元数据，修正一切可以修正的错误，文件系统又可以正常使用了。fsck不能修复的数据，直接丢掉，且fsck全面扫描元数据，是需要长时间的运算的，这是fsck最大的弊病。

4. 日志（一个比fsck更好的解决方案）
