note/linux就是这个范儿.html
<div id="outline-container-orgd468bb9" class="outline-4">
<h4 id="orgd468bb9"><span class="section-number-4">6.2.3.</span> emscs的基本使用</h4>
<div class="outline-text-4" id="text-6-2-3">
<p>
<b>emacs 常用的快捷键</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">move-beginning-of-line</td>
<td class="org-left">c-a</td>
<td class="org-left">光标移动到行首</td>
</tr>

<tr>
<td class="org-left">move-end-of-line</td>
<td class="org-left">c-e</td>
<td class="org-left">光标移动到行尾</td>
</tr>

<tr>
<td class="org-left">forward-char</td>
<td class="org-left">c-f</td>
<td class="org-left">光标右移一个字符</td>
</tr>

<tr>
<td class="org-left">backward-char</td>
<td class="org-left">c-b</td>
<td class="org-left">光标左移一个字符</td>
</tr>

<tr>
<td class="org-left">next-line</td>
<td class="org-left">c-n</td>
<td class="org-left">光标下移一行</td>
</tr>

<tr>
<td class="org-left">previous-line</td>
<td class="org-left">c-p</td>
<td class="org-left">光标上移一行</td>
</tr>

<tr>
<td class="org-left">forward-word</td>
<td class="org-left">m-f</td>
<td class="org-left">光标右移一个单词</td>
</tr>

<tr>
<td class="org-left">backward-word</td>
<td class="org-left">m-b</td>
<td class="org-left">光标左移一个单词</td>
</tr>

<tr>
<td class="org-left">beginning-of-buffer</td>
<td class="org-left">m-&lt;</td>
<td class="org-left">光标移动到文件开头</td>
</tr>

<tr>
<td class="org-left">end-of-buffer</td>
<td class="org-left">m-&lt;</td>
<td class="org-left">光标移动到文件末尾</td>
</tr>

<tr>
<td class="org-left">scroll-up</td>
<td class="org-left">c-v</td>
<td class="org-left">光标移动到下一页</td>
</tr>

<tr>
<td class="org-left">scroll-down</td>
<td class="org-left">m-v</td>
<td class="org-left">光标移动到上一页</td>
</tr>

<tr>
<td class="org-left">set-mark-command</td>
<td class="org-left">c-space</td>
<td class="org-left">开启标记模式，切换到选中状态</td>
</tr>

<tr>
<td class="org-left">mark-whole-buffer</td>
<td class="org-left">c-x h</td>
<td class="org-left">文档全选</td>
</tr>

<tr>
<td class="org-left">kill-region</td>
<td class="org-left">c-w</td>
<td class="org-left">cut 剪切操作</td>
</tr>

<tr>
<td class="org-left">kill-ring-save</td>
<td class="org-left">m-w</td>
<td class="org-left">copy 复制操作</td>
</tr>

<tr>
<td class="org-left">kill-line</td>
<td class="org-left">c-k</td>
<td class="org-left">删除光标到行尾的所有内容</td>
</tr>

<tr>
<td class="org-left">delete-char</td>
<td class="org-left">c-d</td>
<td class="org-left">删除光标所在字符</td>
</tr>

<tr>
<td class="org-left">delete-backward-char</td>
<td class="org-left">退格键</td>
<td class="org-left">删除光标前的字符</td>
</tr>

<tr>
<td class="org-left">yank</td>
<td class="org-left">c-y</td>
<td class="org-left">past 粘帖操作</td>
</tr>

<tr>
<td class="org-left">yank-pop</td>
<td class="org-left">m-y</td>
<td class="org-left">粘帖剪切板中的上个内容，循环剪切板中的内容</td>
</tr>

<tr>
<td class="org-left">undo</td>
<td class="org-left">c-x u或c-_</td>
<td class="org-left">撤销</td>
</tr>

<tr>
<td class="org-left">isearch-forward</td>
<td class="org-left">c-s</td>
<td class="org-left">向下搜索</td>
</tr>

<tr>
<td class="org-left">isearch-backward</td>
<td class="org-left">c-r</td>
<td class="org-left">向上搜索</td>
</tr>

<tr>
<td class="org-left">save-buffer</td>
<td class="org-left">c-x c-s</td>
<td class="org-left">保存</td>
</tr>

<tr>
<td class="org-left">write-file</td>
<td class="org-left">c-x c-w</td>
<td class="org-left">另存</td>
</tr>

<tr>
<td class="org-left">save-buffers-kill-terminal</td>
<td class="org-left">c-x c-c</td>
<td class="org-left">保存并退出</td>
</tr>

<tr>
<td class="org-left">switch-to-buffer</td>
<td class="org-left">c-x b</td>
<td class="org-left">切换已经打开的文件</td>
</tr>

<tr>
<td class="org-left">kill-buffer</td>
<td class="org-left">c-x k</td>
<td class="org-left">关闭已经打开的文件</td>
</tr>
</tbody>
</table>

<p>
<b>emacs获取帮助命令的快捷键</b>
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令</th>
<th scope="col" class="org-left">快捷键</th>
<th scope="col" class="org-left">功能</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">describe-variable</td>
<td class="org-left">c-h v</td>
<td class="org-left">查看某个内置Lisp变量的说明文档</td>
</tr>

<tr>
<td class="org-left">describe-function</td>
<td class="org-left">c-h f</td>
<td class="org-left">查看某个内置命令的说明文档</td>
</tr>

<tr>
<td class="org-left">describe-mode</td>
<td class="org-left">c-h m</td>
<td class="org-left">查看当前buffer对应的mode的说明文档</td>
</tr>

<tr>
<td class="org-left">describe-key</td>
<td class="org-left">c-h k</td>
<td class="org-left">查看某个快捷键对应的命令</td>
</tr>

<tr>
<td class="org-left">where-is</td>
<td class="org-left">c-h w</td>
<td class="org-left">查看某个命令绑定的快捷键</td>
</tr>

<tr>
<td class="org-left">describe-bindings</td>
<td class="org-left">c-h b</td>
<td class="org-left">查看当前buffer所有的快捷键列表</td>
</tr>

<tr>
<td class="org-left">find-function</td>
<td class="org-left">无</td>
<td class="org-left">查看某个内置命令的Lisp源代码</td>
</tr>

<tr>
<td class="org-left">find-variable</td>
<td class="org-left">无</td>
<td class="org-left">查看某个内置变量的Lisp源代码</td>
</tr>

<tr>
<td class="org-left">Apropos</td>
<td class="org-left">无</td>
<td class="org-left">模糊查询内置命令或变量的说明文档</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8459b66" class="outline-4">
<h4 id="org8459b66"><span class="section-number-4">6.2.4.</span> Lisp语言</h4>
<div class="outline-text-4" id="text-6-2-4">
<ul class="org-ul">
<li>Lisp是世界上第一个函数性编程语言</li>
<li>Lisp只有两种基本的数据</li>
<li>Lisp只有唯一的一种基本语法结构——表达式</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="org9322432"></a>Lisp的原子和表<br />
<div class="outline-text-5" id="text-6-2-4-1">
<ul class="org-ul">
<li>Lisp的表达式是由一个原子（atom）或表（list）构成。</li>
<li>原子（atom）由符号（symbol）和数值（number）构成。</li>
<li>表是由零个或多个表达式组成的串行，表达式之间用空格分开，放入一对括号中</li>
<li>原子和表：</li>
</ul>
<p>
abc ; 原子<br />
（）   ;  空表<br />
（abc xyz）; 包含两个原子的表<br />
（a b （c）d）; 包含四个原子的表，其中第三个原子本身也是表，这种表称为嵌套表。
</p>
</div>
</li>
<li><a id="org80c553f"></a>Lisp中的表达式<br />
<div class="outline-text-5" id="text-6-2-4-2">
<p>
如果表达式是一个表，把表中的第一个元素叫做操作符，其余的元素叫做自变量。在lisp中，1+1的表达式的写法是：<br />
          (+ 1 1)
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgfa5adb3" class="outline-2">
<h2 id="orgfa5adb3"><span class="section-number-2">7.</span> 第九章 特种文件系统</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org0cbf999" class="outline-3">
<h3 id="org0cbf999"><span class="section-number-3">7.1.</span> 日志和ReiserFS</h3>
<div class="outline-text-3" id="text-7-1">
</div>
<div id="outline-container-org0007538" class="outline-4">
<h4 id="org0007538"><span class="section-number-4">7.1.1.</span> 理解日志</h4>
<div class="outline-text-4" id="text-7-1-1">
<ol class="org-ol">
<li>元数据</li>
</ol>
<p>
元数据就是诠释数据的数据。  作为文件系统，一定要提供存储、查询和处理数据的功能。  文件系统内部就保存了一个内部数据结构，使得这些操作成为可能，这个内部数据结构就是元数据，他为文件系统提供特定的身份和性能特征。
</p>

<p>
元数据对于大部分人来说是不必关心的，因为元数据是专门交给文件系统的驱动程序使用的。  想要文件系统的驱动程序好好干活，它就得轻松愉快的找到元数据。  有三个要求：
</p>
<ul class="org-ul">
<li>合理</li>
<li>一致</li>
<li>无干扰</li>
</ul>

<p>
做不到这三点的话，驱动程序就无法理解元数据，也操作不了，那么，就只能跟文件系统说拜拜了。  
</p>

<p>
文件系统是文件系统，文件系统的驱动程序是文件系统的驱动程序，不是一码事
</p>

<ol class="org-ol">
<li>fsck</li>
</ol>
<p>
fsck确保文件系统驱动程序要用的元数据是干净的
</p>

<p>
每次linux启动，在没有挂接任何文件系统的时候都会启动fsck扫描/etc/fstab 文件中列出的本地文件系统；  每次linux关闭，它要把还在内存中的被称之为页面缓存中的数据传送到磁盘，还要保证把已经挂接的文件系统卸载干净。
</p>

<ol class="org-ol">
<li>fsck的问题</li>
</ol>
<p>
当linux遇到异常关机，重启后，fsck就会发现文件系统没有卸载赶紧，对应的元数据可能不干净，已经出了问题，于是fsck开始全面审查元数据，修正一切可以修正的错误，文件系统又可以正常使用了。fsck不能修复的数据，直接丢掉，且fsck全面扫描元数据，是需要长时间的运算的，这是fsck最大的弊病。
</p>

<ol class="org-ol">
<li>日志（一个比fsck更好的解决方案）</li>
</ol>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#20316;&#32773;: CYQ</p>
<p class="date">Created: 2025-12-07 Sun 12:17</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
